{"verses":[{"id":2030,"verseNumber":1,"verseKey":"17:1","arabic":" سُبْحَـٰنَ ٱلَّذِىٓ أَسْرَىٰ بِعَبْدِهِۦ لَيْلًا مِّنَ ٱلْمَسْجِدِ ٱلْحَرَامِ إِلَى ٱلْمَسْجِدِ ٱلْأَقْصَا ٱلَّذِى بَـٰرَكْنَا حَوْلَهُۥ لِنُرِيَهُۥ مِنْ ءَايَـٰتِنَآ ۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ","english":"Glory be to the One Who took His servant ˹Muḥammad˺ by night from the Sacred Mosque to the Farthest Mosque whose surroundings We have blessed, so that We may show him some of Our signs.<sup foot_note=76859>1</sup> Indeed, He<sup foot_note=76860>2</sup> alone is the All-Hearing, All-Seeing."},{"id":2031,"verseNumber":2,"verseKey":"17:2","arabic":"وَءَاتَيْنَا مُوسَى ٱلْكِتَـٰبَ وَجَعَلْنَـٰهُ هُدًى لِّبَنِىٓ إِسْرَٰٓءِيلَ أَلَّا تَتَّخِذُوا۟ مِن دُونِى وَكِيلًا","english":"And We gave Moses the Scripture and made it a guide for the Children of Israel, ˹stating:˺ “Do not take besides Me any other Trustee of Affairs,"},{"id":2032,"verseNumber":3,"verseKey":"17:3","arabic":"ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوحٍ ۚ إِنَّهُۥ كَانَ عَبْدًا شَكُورًا","english":"˹O˺ descendants of those We carried with Noah ˹in the Ark˺! He was indeed a grateful servant.”"},{"id":2033,"verseNumber":4,"verseKey":"17:4","arabic":"وَقَضَيْنَآ إِلَىٰ بَنِىٓ إِسْرَٰٓءِيلَ فِى ٱلْكِتَـٰبِ لَتُفْسِدُنَّ فِى ٱلْأَرْضِ مَرَّتَيْنِ وَلَتَعْلُنَّ عُلُوًّا كَبِيرًا","english":"And We warned the Children of Israel in the Scripture, “You will certainly cause corruption in the land twice, and you will become extremely arrogant."},{"id":2034,"verseNumber":5,"verseKey":"17:5","arabic":"فَإِذَا جَآءَ وَعْدُ أُولَىٰهُمَا بَعَثْنَا عَلَيْكُمْ عِبَادًا لَّنَآ أُو۟لِى بَأْسٍ شَدِيدٍ فَجَاسُوا۟ خِلَـٰلَ ٱلدِّيَارِ ۚ وَكَانَ وَعْدًا مَّفْعُولًا","english":"When the first of the two warnings would come to pass, We would send against you some of Our servants of great might, who would ravage your homes. This would be a warning fulfilled."},{"id":2035,"verseNumber":6,"verseKey":"17:6","arabic":"ثُمَّ رَدَدْنَا لَكُمُ ٱلْكَرَّةَ عَلَيْهِمْ وَأَمْدَدْنَـٰكُم بِأَمْوَٰلٍ وَبَنِينَ وَجَعَلْنَـٰكُمْ أَكْثَرَ نَفِيرًا","english":"Then ˹after your repentance˺ We would give you the upper hand over them and aid you with wealth and offspring, causing you to outnumber them."},{"id":2036,"verseNumber":7,"verseKey":"17:7","arabic":"إِنْ أَحْسَنتُمْ أَحْسَنتُمْ لِأَنفُسِكُمْ ۖ وَإِنْ أَسَأْتُمْ فَلَهَا ۚ فَإِذَا جَآءَ وَعْدُ ٱلْـَٔاخِرَةِ لِيَسُـۥٓـُٔوا۟ وُجُوهَكُمْ وَلِيَدْخُلُوا۟ ٱلْمَسْجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٍ وَلِيُتَبِّرُوا۟ مَا عَلَوْا۟ تَتْبِيرًا","english":"If you act rightly, it is for your own good, but if you do wrong, it is to your own loss. “And when the second warning would come to pass, your enemies would ˹be left to˺ totally disgrace you and enter the Temple ˹of Jerusalem˺ as they entered it the first time, and utterly destroy whatever would fall into their hands."},{"id":2037,"verseNumber":8,"verseKey":"17:8","arabic":"عَسَىٰ رَبُّكُمْ أَن يَرْحَمَكُمْ ۚ وَإِنْ عُدتُّمْ عُدْنَا ۘ وَجَعَلْنَا جَهَنَّمَ لِلْكَـٰفِرِينَ حَصِيرًا","english":"Perhaps your Lord will have mercy on you ˹if you repent˺, but if you return ˹to sin˺, We will return ˹to punishment˺. And We have made Hell a ˹permanent˺ confinement for the disbelievers.”"},{"id":2038,"verseNumber":9,"verseKey":"17:9","arabic":"إِنَّ هَـٰذَا ٱلْقُرْءَانَ يَهْدِى لِلَّتِى هِىَ أَقْوَمُ وَيُبَشِّرُ ٱلْمُؤْمِنِينَ ٱلَّذِينَ يَعْمَلُونَ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمْ أَجْرًا كَبِيرًا","english":"Surely this Quran guides to what is most upright, and gives good news to the believers—who do good—that they will have a mighty reward."},{"id":2039,"verseNumber":10,"verseKey":"17:10","arabic":"وَأَنَّ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱلْـَٔاخِرَةِ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًا","english":"And ˹it warns˺ those who do not believe in the Hereafter ˹that˺ We have prepared for them a painful punishment."},{"id":2040,"verseNumber":11,"verseKey":"17:11","arabic":"وَيَدْعُ ٱلْإِنسَـٰنُ بِٱلشَّرِّ دُعَآءَهُۥ بِٱلْخَيْرِ ۖ وَكَانَ ٱلْإِنسَـٰنُ عَجُولًا","english":"And humans ˹swiftly˺ pray for evil<sup foot_note=76861>1</sup> as they pray for good. For humankind is ever hasty."},{"id":2041,"verseNumber":12,"verseKey":"17:12","arabic":"وَجَعَلْنَا ٱلَّيْلَ وَٱلنَّهَارَ ءَايَتَيْنِ ۖ فَمَحَوْنَآ ءَايَةَ ٱلَّيْلِ وَجَعَلْنَآ ءَايَةَ ٱلنَّهَارِ مُبْصِرَةً لِّتَبْتَغُوا۟ فَضْلًا مِّن رَّبِّكُمْ وَلِتَعْلَمُوا۟ عَدَدَ ٱلسِّنِينَ وَٱلْحِسَابَ ۚ وَكُلَّ شَىْءٍ فَصَّلْنَـٰهُ تَفْصِيلًا","english":"We made the day and night as two signs. So We made the sign of the night devoid of light, and We made the sign of the day ˹perfectly˺ bright, so that you may seek the bounty of your Lord and know the number of years and calculation ˹of time˺. And We have explained everything in detail."},{"id":2042,"verseNumber":13,"verseKey":"17:13","arabic":"وَكُلَّ إِنسَـٰنٍ أَلْزَمْنَـٰهُ طَـٰٓئِرَهُۥ فِى عُنُقِهِۦ ۖ وَنُخْرِجُ لَهُۥ يَوْمَ ٱلْقِيَـٰمَةِ كِتَـٰبًا يَلْقَىٰهُ مَنشُورًا","english":"We have bound every human’s destiny to their neck.<sup foot_note=76862>1</sup> And on the Day of Judgment We will bring forth to each ˹person˺ a record which they will find laid open."},{"id":2043,"verseNumber":14,"verseKey":"17:14","arabic":"ٱقْرَأْ كِتَـٰبَكَ كَفَىٰ بِنَفْسِكَ ٱلْيَوْمَ عَلَيْكَ حَسِيبًا","english":"˹And it will be said,˺ “Read your record. You ˹alone˺ are sufficient this Day to take account of yourself.”"},{"id":2044,"verseNumber":15,"verseKey":"17:15","arabic":"مَّنِ ٱهْتَدَىٰ فَإِنَّمَا يَهْتَدِى لِنَفْسِهِۦ ۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۚ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ وَمَا كُنَّا مُعَذِّبِينَ حَتَّىٰ نَبْعَثَ رَسُولًا","english":"Whoever chooses to be guided, it is only for their own good. And whoever chooses to stray, it is only to their own loss. No soul burdened with sin will bear the burden of another. And We would never punish ˹a people˺ until We have sent a messenger ˹to warn them˺."},{"id":2045,"verseNumber":16,"verseKey":"17:16","arabic":"وَإِذَآ أَرَدْنَآ أَن نُّهْلِكَ قَرْيَةً أَمَرْنَا مُتْرَفِيهَا فَفَسَقُوا۟ فِيهَا فَحَقَّ عَلَيْهَا ٱلْقَوْلُ فَدَمَّرْنَـٰهَا تَدْمِيرًا","english":"Whenever We intend to destroy a society, We command its elite ˹to obey Allah˺ but they act rebelliously in it. So the decree ˹of punishment˺ is justified, and We destroy it utterly."},{"id":2046,"verseNumber":17,"verseKey":"17:17","arabic":"وَكَمْ أَهْلَكْنَا مِنَ ٱلْقُرُونِ مِنۢ بَعْدِ نُوحٍ ۗ وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِۦ خَبِيرًۢا بَصِيرًا","english":"˹Imagine˺ how many peoples We have destroyed after Noah! And sufficient is your Lord as All-Aware and All-Seeing of the sins of His servants."},{"id":2047,"verseNumber":18,"verseKey":"17:18","arabic":"مَّن كَانَ يُرِيدُ ٱلْعَاجِلَةَ عَجَّلْنَا لَهُۥ فِيهَا مَا نَشَآءُ لِمَن نُّرِيدُ ثُمَّ جَعَلْنَا لَهُۥ جَهَنَّمَ يَصْلَىٰهَا مَذْمُومًا مَّدْحُورًا","english":"Whoever desires this fleeting world ˹alone˺, We hasten in it whatever We please to whoever We will; then We destine them for Hell, where they will burn, condemned and rejected."},{"id":2048,"verseNumber":19,"verseKey":"17:19","arabic":"وَمَنْ أَرَادَ ٱلْـَٔاخِرَةَ وَسَعَىٰ لَهَا سَعْيَهَا وَهُوَ مُؤْمِنٌ فَأُو۟لَـٰٓئِكَ كَانَ سَعْيُهُم مَّشْكُورًا","english":"But whoever desires the Hereafter and strives for it accordingly, and is a ˹true˺ believer, it is they whose striving will be appreciated."},{"id":2049,"verseNumber":20,"verseKey":"17:20","arabic":"كُلًّا نُّمِدُّ هَـٰٓؤُلَآءِ وَهَـٰٓؤُلَآءِ مِنْ عَطَآءِ رَبِّكَ ۚ وَمَا كَانَ عَطَآءُ رَبِّكَ مَحْظُورًا","english":"We provide both the former and the latter from the bounty of your Lord. And the bounty of your Lord can never be withheld."},{"id":2050,"verseNumber":21,"verseKey":"17:21","arabic":"ٱنظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ ۚ وَلَلْـَٔاخِرَةُ أَكْبَرُ دَرَجَـٰتٍ وَأَكْبَرُ تَفْضِيلًا","english":"See how We have favoured some over others ˹in this life˺, but the Hereafter is certainly far greater in rank and in favour."},{"id":2051,"verseNumber":22,"verseKey":"17:22","arabic":"لَّا تَجْعَلْ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ فَتَقْعُدَ مَذْمُومًا مَّخْذُولًا","english":"Do not set up any other god with Allah, or you will end up condemned, abandoned."},{"id":2052,"verseNumber":23,"verseKey":"17:23","arabic":"۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوٓا۟ إِلَّآ إِيَّاهُ وَبِٱلْوَٰلِدَيْنِ إِحْسَـٰنًا ۚ إِمَّا يَبْلُغَنَّ عِندَكَ ٱلْكِبَرَ أَحَدُهُمَآ أَوْ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفٍّ وَلَا تَنْهَرْهُمَا وَقُل لَّهُمَا قَوْلًا كَرِيمًا","english":"For your Lord has decreed that you worship none but Him. And honour your parents. If one or both of them reach old age in your care, never say to them ˹even˺ ‘ugh,’ nor yell at them. Rather, address them respectfully."},{"id":2053,"verseNumber":24,"verseKey":"17:24","arabic":"وَٱخْفِضْ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحْمَةِ وَقُل رَّبِّ ٱرْحَمْهُمَا كَمَا رَبَّيَانِى صَغِيرًا","english":"And be humble with them out of mercy, and pray, “My Lord! Be merciful to them as they raised me when I was young.”"},{"id":2054,"verseNumber":25,"verseKey":"17:25","arabic":"رَّبُّكُمْ أَعْلَمُ بِمَا فِى نُفُوسِكُمْ ۚ إِن تَكُونُوا۟ صَـٰلِحِينَ فَإِنَّهُۥ كَانَ لِلْأَوَّٰبِينَ غَفُورًا","english":"Your Lord knows best what is within yourselves. If you are righteous, He is certainly All-Forgiving to those who ˹constantly˺ turn to Him."},{"id":2055,"verseNumber":26,"verseKey":"17:26","arabic":"وَءَاتِ ذَا ٱلْقُرْبَىٰ حَقَّهُۥ وَٱلْمِسْكِينَ وَٱبْنَ ٱلسَّبِيلِ وَلَا تُبَذِّرْ تَبْذِيرًا","english":"Give to close relatives their due, as well as the poor and ˹needy˺ travellers. And do not spend wastefully."},{"id":2056,"verseNumber":27,"verseKey":"17:27","arabic":"إِنَّ ٱلْمُبَذِّرِينَ كَانُوٓا۟ إِخْوَٰنَ ٱلشَّيَـٰطِينِ ۖ وَكَانَ ٱلشَّيْطَـٰنُ لِرَبِّهِۦ كَفُورًا","english":"Surely the wasteful are ˹like˺ brothers to the devils. And the Devil is ever ungrateful to his Lord."},{"id":2057,"verseNumber":28,"verseKey":"17:28","arabic":"وَإِمَّا تُعْرِضَنَّ عَنْهُمُ ٱبْتِغَآءَ رَحْمَةٍ مِّن رَّبِّكَ تَرْجُوهَا فَقُل لَّهُمْ قَوْلًا مَّيْسُورًا","english":"But if you must turn them down ˹because you lack the means to give˺—while hoping to receive your Lord’s bounty—then ˹at least˺ give them a kind word."},{"id":2058,"verseNumber":29,"verseKey":"17:29","arabic":"وَلَا تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبْسُطْهَا كُلَّ ٱلْبَسْطِ فَتَقْعُدَ مَلُومًا مَّحْسُورًا","english":"Do not be so tight-fisted, for you will be blameworthy; nor so open-handed, for you will end up in poverty."},{"id":2059,"verseNumber":30,"verseKey":"17:30","arabic":"إِنَّ رَبَّكَ يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ وَيَقْدِرُ ۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرًۢا بَصِيرًا","english":"Surely your Lord gives abundant or limited provisions to whoever He wills. He is certainly All-Aware, All-Seeing of His servants."},{"id":2060,"verseNumber":31,"verseKey":"17:31","arabic":"وَلَا تَقْتُلُوٓا۟ أَوْلَـٰدَكُمْ خَشْيَةَ إِمْلَـٰقٍ ۖ نَّحْنُ نَرْزُقُهُمْ وَإِيَّاكُمْ ۚ إِنَّ قَتْلَهُمْ كَانَ خِطْـًٔا كَبِيرًا","english":"Do not kill your children for fear of poverty. We provide for them and for you. Surely killing them is a heinous sin."},{"id":2061,"verseNumber":32,"verseKey":"17:32","arabic":"وَلَا تَقْرَبُوا۟ ٱلزِّنَىٰٓ ۖ إِنَّهُۥ كَانَ فَـٰحِشَةً وَسَآءَ سَبِيلًا","english":"Do not go near adultery. It is truly a shameful deed and an evil way."},{"id":2062,"verseNumber":33,"verseKey":"17:33","arabic":"وَلَا تَقْتُلُوا۟ ٱلنَّفْسَ ٱلَّتِى حَرَّمَ ٱللَّهُ إِلَّا بِٱلْحَقِّ ۗ وَمَن قُتِلَ مَظْلُومًا فَقَدْ جَعَلْنَا لِوَلِيِّهِۦ سُلْطَـٰنًا فَلَا يُسْرِف فِّى ٱلْقَتْلِ ۖ إِنَّهُۥ كَانَ مَنصُورًا","english":"Do not take a ˹human˺ life—made sacred by Allah—except with ˹legal˺ right.<sup foot_note=76863>1</sup> If anyone is killed unjustly, We have given their heirs<sup foot_note=76864>2</sup> the authority, but do not let them exceed limits in retaliation,<sup foot_note=76865>3</sup> for they are already supported ˹by law˺."},{"id":2063,"verseNumber":34,"verseKey":"17:34","arabic":"وَلَا تَقْرَبُوا۟ مَالَ ٱلْيَتِيمِ إِلَّا بِٱلَّتِى هِىَ أَحْسَنُ حَتَّىٰ يَبْلُغَ أَشُدَّهُۥ ۚ وَأَوْفُوا۟ بِٱلْعَهْدِ ۖ إِنَّ ٱلْعَهْدَ كَانَ مَسْـُٔولًا","english":"Do not come near the wealth of the orphan—unless intending to enhance it—until they attain maturity. Honour ˹your˺ pledges, for you will surely be accountable for them."},{"id":2064,"verseNumber":35,"verseKey":"17:35","arabic":"وَأَوْفُوا۟ ٱلْكَيْلَ إِذَا كِلْتُمْ وَزِنُوا۟ بِٱلْقِسْطَاسِ ٱلْمُسْتَقِيمِ ۚ ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلًا","english":"Give in full when you measure, and weigh with an even balance. That is fairest and best in the end."},{"id":2065,"verseNumber":36,"verseKey":"17:36","arabic":"وَلَا تَقْفُ مَا لَيْسَ لَكَ بِهِۦ عِلْمٌ ۚ إِنَّ ٱلسَّمْعَ وَٱلْبَصَرَ وَٱلْفُؤَادَ كُلُّ أُو۟لَـٰٓئِكَ كَانَ عَنْهُ مَسْـُٔولًا","english":"Do not follow what you have no ˹sure˺ knowledge of. Indeed, all will be called to account for ˹their˺ hearing, sight, and intellect."},{"id":2066,"verseNumber":37,"verseKey":"17:37","arabic":"وَلَا تَمْشِ فِى ٱلْأَرْضِ مَرَحًا ۖ إِنَّكَ لَن تَخْرِقَ ٱلْأَرْضَ وَلَن تَبْلُغَ ٱلْجِبَالَ طُولًا","english":"And do not walk on the earth arrogantly. Surely you can neither crack the earth nor stretch to the height of the mountains."},{"id":2067,"verseNumber":38,"verseKey":"17:38","arabic":"كُلُّ ذَٰلِكَ كَانَ سَيِّئُهُۥ عِندَ رَبِّكَ مَكْرُوهًا","english":"The violation of any of these ˹commandments˺ is detestable to your Lord."},{"id":2068,"verseNumber":39,"verseKey":"17:39","arabic":"ذَٰلِكَ مِمَّآ أَوْحَىٰٓ إِلَيْكَ رَبُّكَ مِنَ ٱلْحِكْمَةِ ۗ وَلَا تَجْعَلْ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ فَتُلْقَىٰ فِى جَهَنَّمَ مَلُومًا مَّدْحُورًا","english":"This is part of the wisdom which your Lord has revealed to you ˹O Prophet˺. And do not set up any other god with Allah ˹O humanity˺, or you will be cast into Hell, blameworthy, rejected."},{"id":2069,"verseNumber":40,"verseKey":"17:40","arabic":"أَفَأَصْفَىٰكُمْ رَبُّكُم بِٱلْبَنِينَ وَٱتَّخَذَ مِنَ ٱلْمَلَـٰٓئِكَةِ إِنَـٰثًا ۚ إِنَّكُمْ لَتَقُولُونَ قَوْلًا عَظِيمًا","english":"Has your Lord favoured you ˹pagans˺ with sons and taken angels as ˹His˺ daughters?<sup foot_note=76866>1</sup> You are truly making an outrageous claim."},{"id":2070,"verseNumber":41,"verseKey":"17:41","arabic":"وَلَقَدْ صَرَّفْنَا فِى هَـٰذَا ٱلْقُرْءَانِ لِيَذَّكَّرُوا۟ وَمَا يَزِيدُهُمْ إِلَّا نُفُورًا","english":"We have surely varied ˹the signs˺ in this Quran so perhaps they may be mindful, but it only drives them farther away."},{"id":2071,"verseNumber":42,"verseKey":"17:42","arabic":"قُل لَّوْ كَانَ مَعَهُۥٓ ءَالِهَةٌ كَمَا يَقُولُونَ إِذًا لَّٱبْتَغَوْا۟ إِلَىٰ ذِى ٱلْعَرْشِ سَبِيلًا","english":"Say, ˹O Prophet,˺ “Had there been other gods besides Him—as they claim—then they would have certainly sought a way to ˹challenge˺ the Lord of the Throne.”"},{"id":2072,"verseNumber":43,"verseKey":"17:43","arabic":"سُبْحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا يَقُولُونَ عُلُوًّا كَبِيرًا","english":"Glorified and Highly Exalted is He above what they claim!"},{"id":2073,"verseNumber":44,"verseKey":"17:44","arabic":"تُسَبِّحُ لَهُ ٱلسَّمَـٰوَٰتُ ٱلسَّبْعُ وَٱلْأَرْضُ وَمَن فِيهِنَّ ۚ وَإِن مِّن شَىْءٍ إِلَّا يُسَبِّحُ بِحَمْدِهِۦ وَلَـٰكِن لَّا تَفْقَهُونَ تَسْبِيحَهُمْ ۗ إِنَّهُۥ كَانَ حَلِيمًا غَفُورًا","english":"The seven heavens, the earth, and all those in them glorify Him. There is not a single thing that does not glorify His praises—but you ˹simply˺ cannot comprehend their glorification. He is indeed Most Forbearing, All-Forgiving."},{"id":2074,"verseNumber":45,"verseKey":"17:45","arabic":"وَإِذَا قَرَأْتَ ٱلْقُرْءَانَ جَعَلْنَا بَيْنَكَ وَبَيْنَ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱلْـَٔاخِرَةِ حِجَابًا مَّسْتُورًا","english":"When you ˹O Prophet˺ recite the Quran, We put a hidden barrier between you and those who do not believe in the Hereafter."},{"id":2075,"verseNumber":46,"verseKey":"17:46","arabic":"وَجَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَن يَفْقَهُوهُ وَفِىٓ ءَاذَانِهِمْ وَقْرًا ۚ وَإِذَا ذَكَرْتَ رَبَّكَ فِى ٱلْقُرْءَانِ وَحْدَهُۥ وَلَّوْا۟ عَلَىٰٓ أَدْبَـٰرِهِمْ نُفُورًا","english":"We have cast veils over their hearts—leaving them unable to comprehend it—and deafness in their ears. And when you mention your Lord alone in the Quran, they turn their backs in aversion."},{"id":2076,"verseNumber":47,"verseKey":"17:47","arabic":"نَّحْنُ أَعْلَمُ بِمَا يَسْتَمِعُونَ بِهِۦٓ إِذْ يَسْتَمِعُونَ إِلَيْكَ وَإِذْ هُمْ نَجْوَىٰٓ إِذْ يَقُولُ ٱلظَّـٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلًا مَّسْحُورًا","english":"We know best how they listen to your recitation and what they say privately—when the wrongdoers say, “You would only be following a bewitched man.”"},{"id":2077,"verseNumber":48,"verseKey":"17:48","arabic":"ٱنظُرْ كَيْفَ ضَرَبُوا۟ لَكَ ٱلْأَمْثَالَ فَضَلُّوا۟ فَلَا يَسْتَطِيعُونَ سَبِيلًا","english":"See how they call you names ˹O Prophet˺!<sup foot_note=76867>1</sup> So they have gone so ˹far˺ astray that they cannot find the ˹Right˺ Way."},{"id":2078,"verseNumber":49,"verseKey":"17:49","arabic":"وَقَالُوٓا۟ أَءِذَا كُنَّا عِظَـٰمًا وَرُفَـٰتًا أَءِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا","english":"And they say ˹mockingly˺, “When we are reduced to bones and ashes, will we really be raised as a new creation?”"},{"id":2079,"verseNumber":50,"verseKey":"17:50","arabic":"۞ قُلْ كُونُوا۟ حِجَارَةً أَوْ حَدِيدًا","english":"Say, ˹O Prophet,˺ “˹Yes, even if˺ you become stones, or iron,"},{"id":2080,"verseNumber":51,"verseKey":"17:51","arabic":"أَوْ خَلْقًا مِّمَّا يَكْبُرُ فِى صُدُورِكُمْ ۚ فَسَيَقُولُونَ مَن يُعِيدُنَا ۖ قُلِ ٱلَّذِى فَطَرَكُمْ أَوَّلَ مَرَّةٍ ۚ فَسَيُنْغِضُونَ إِلَيْكَ رُءُوسَهُمْ وَيَقُولُونَ مَتَىٰ هُوَ ۖ قُلْ عَسَىٰٓ أَن يَكُونَ قَرِيبًا","english":"or whatever you think is harder to bring to life!” Then they will ask ˹you˺, “Who will bring us back ˹to life˺?” Say, “The One Who created you the first time.” They will then shake their heads at you and ask, “When will that be?” Say, “Perhaps it is soon!”"},{"id":2081,"verseNumber":52,"verseKey":"17:52","arabic":"يَوْمَ يَدْعُوكُمْ فَتَسْتَجِيبُونَ بِحَمْدِهِۦ وَتَظُنُّونَ إِن لَّبِثْتُمْ إِلَّا قَلِيلًا","english":"On the Day He will call you, you will ˹instantly˺ respond by praising Him,<sup foot_note=76868>1</sup> thinking you had remained ˹in the world˺ only for a little while."},{"id":2082,"verseNumber":53,"verseKey":"17:53","arabic":"وَقُل لِّعِبَادِى يَقُولُوا۟ ٱلَّتِى هِىَ أَحْسَنُ ۚ إِنَّ ٱلشَّيْطَـٰنَ يَنزَغُ بَيْنَهُمْ ۚ إِنَّ ٱلشَّيْطَـٰنَ كَانَ لِلْإِنسَـٰنِ عَدُوًّا مُّبِينًا","english":"Tell My ˹believing˺ servants to say only what is best. Satan certainly seeks to sow discord among them. Satan is indeed a sworn enemy to humankind."},{"id":2083,"verseNumber":54,"verseKey":"17:54","arabic":"رَّبُّكُمْ أَعْلَمُ بِكُمْ ۖ إِن يَشَأْ يَرْحَمْكُمْ أَوْ إِن يَشَأْ يُعَذِّبْكُمْ ۚ وَمَآ أَرْسَلْنَـٰكَ عَلَيْهِمْ وَكِيلًا","english":"Your Lord knows you best. He may have mercy on you if He wills, or punish you if He wills. We have not sent you ˹O Prophet˺ as a keeper over them."},{"id":2084,"verseNumber":55,"verseKey":"17:55","arabic":"وَرَبُّكَ أَعْلَمُ بِمَن فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۗ وَلَقَدْ فَضَّلْنَا بَعْضَ ٱلنَّبِيِّـۧنَ عَلَىٰ بَعْضٍ ۖ وَءَاتَيْنَا دَاوُۥدَ زَبُورًا","english":"Your Lord knows best all those in the heavens and the earth. And We have surely favoured some prophets above others, and to David We gave the Psalms.<sup foot_note=76869>1</sup> "},{"id":2085,"verseNumber":56,"verseKey":"17:56","arabic":"قُلِ ٱدْعُوا۟ ٱلَّذِينَ زَعَمْتُم مِّن دُونِهِۦ فَلَا يَمْلِكُونَ كَشْفَ ٱلضُّرِّ عَنكُمْ وَلَا تَحْوِيلًا","english":"Say, ˹O Prophet,˺ “Invoke those you claim ˹to be divine˺<sup foot_note=76870>1</sup> besides Him—they do not have the power to undo harm from you or transfer it ˹to someone else˺.”"},{"id":2086,"verseNumber":57,"verseKey":"17:57","arabic":"أُو۟لَـٰٓئِكَ ٱلَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَىٰ رَبِّهِمُ ٱلْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ وَيَرْجُونَ رَحْمَتَهُۥ وَيَخَافُونَ عَذَابَهُۥٓ ۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحْذُورًا","english":"˹Even˺ the closest ˹to Allah˺ of those invoked would be seeking a way to their Lord, hoping for His mercy, and fearing His punishment. Indeed, your Lord’s torment is fearsome."},{"id":2087,"verseNumber":58,"verseKey":"17:58","arabic":"وَإِن مِّن قَرْيَةٍ إِلَّا نَحْنُ مُهْلِكُوهَا قَبْلَ يَوْمِ ٱلْقِيَـٰمَةِ أَوْ مُعَذِّبُوهَا عَذَابًا شَدِيدًا ۚ كَانَ ذَٰلِكَ فِى ٱلْكِتَـٰبِ مَسْطُورًا","english":"There is not a ˹wicked˺ society that We will not destroy or punish with a severe torment before the Day of Judgment. That is written in the Record."},{"id":2088,"verseNumber":59,"verseKey":"17:59","arabic":"وَمَا مَنَعَنَآ أَن نُّرْسِلَ بِٱلْـَٔايَـٰتِ إِلَّآ أَن كَذَّبَ بِهَا ٱلْأَوَّلُونَ ۚ وَءَاتَيْنَا ثَمُودَ ٱلنَّاقَةَ مُبْصِرَةً فَظَلَمُوا۟ بِهَا ۚ وَمَا نُرْسِلُ بِٱلْـَٔايَـٰتِ إِلَّا تَخْوِيفًا","english":"Nothing keeps Us from sending the ˹demanded˺ signs except that they had ˹already˺ been denied by earlier peoples. And We gave Thamûd the she-camel as a clear sign, but they wrongfully rejected it.<sup foot_note=76871>1</sup> We only send the signs as a warning."},{"id":2089,"verseNumber":60,"verseKey":"17:60","arabic":"وَإِذْ قُلْنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِ ۚ وَمَا جَعَلْنَا ٱلرُّءْيَا ٱلَّتِىٓ أَرَيْنَـٰكَ إِلَّا فِتْنَةً لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلْمَلْعُونَةَ فِى ٱلْقُرْءَانِ ۚ وَنُخَوِّفُهُمْ فَمَا يَزِيدُهُمْ إِلَّا طُغْيَـٰنًا كَبِيرًا","english":"And ˹remember, O  Prophet˺ when We told you, “Certainly your Lord encompasses the people.” And We have made what We brought you to see<sup foot_note=76872>1</sup> as well as the cursed tree ˹mentioned˺ in the Quran<sup foot_note=76873>2</sup> only as a test for the people. We keep warning them, but it only increases them greatly in defiance."},{"id":2090,"verseNumber":61,"verseKey":"17:61","arabic":"وَإِذْ قُلْنَا لِلْمَلَـٰٓئِكَةِ ٱسْجُدُوا۟ لِـَٔادَمَ فَسَجَدُوٓا۟ إِلَّآ إِبْلِيسَ قَالَ ءَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا","english":"And ˹remember˺ when We said to the angels, “Prostrate before Adam,” so they all did—but not Iblîs,<sup foot_note=76874>1</sup> who protested, “Should I prostrate to the one You have created from mud?”"},{"id":2091,"verseNumber":62,"verseKey":"17:62","arabic":"قَالَ أَرَءَيْتَكَ هَـٰذَا ٱلَّذِى كَرَّمْتَ عَلَىَّ لَئِنْ أَخَّرْتَنِ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ لَأَحْتَنِكَنَّ ذُرِّيَّتَهُۥٓ إِلَّا قَلِيلًا","english":"Adding, “Do you see this one you honoured above me? If you delay my end until the Day of Judgment, I will certainly take hold of his descendants, except for a few.”"},{"id":2092,"verseNumber":63,"verseKey":"17:63","arabic":"قَالَ ٱذْهَبْ فَمَن تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزَآؤُكُمْ جَزَآءً مَّوْفُورًا","english":"Allah responded, “Be gone! Whoever of them follows you, Hell will surely be the reward for all of you—an ample reward."},{"id":2093,"verseNumber":64,"verseKey":"17:64","arabic":"وَٱسْتَفْزِزْ مَنِ ٱسْتَطَعْتَ مِنْهُم بِصَوْتِكَ وَأَجْلِبْ عَلَيْهِم بِخَيْلِكَ وَرَجِلِكَ وَشَارِكْهُمْ فِى ٱلْأَمْوَٰلِ وَٱلْأَوْلَـٰدِ وَعِدْهُمْ ۚ وَمَا يَعِدُهُمُ ٱلشَّيْطَـٰنُ إِلَّا غُرُورًا","english":"And incite whoever you can of them with your voice, mobilize against them all your cavalry and infantry, manipulate them in their wealth and children, and make them promises.” But Satan promises them nothing but delusion."},{"id":2094,"verseNumber":65,"verseKey":"17:65","arabic":"إِنَّ عِبَادِى لَيْسَ لَكَ عَلَيْهِمْ سُلْطَـٰنٌ ۚ وَكَفَىٰ بِرَبِّكَ وَكِيلًا","english":"˹Allah added,˺ “You will truly have no authority over My ˹faithful˺ servants.” And sufficient is your Lord as a Guardian."},{"id":2095,"verseNumber":66,"verseKey":"17:66","arabic":"رَّبُّكُمُ ٱلَّذِى يُزْجِى لَكُمُ ٱلْفُلْكَ فِى ٱلْبَحْرِ لِتَبْتَغُوا۟ مِن فَضْلِهِۦٓ ۚ إِنَّهُۥ كَانَ بِكُمْ رَحِيمًا","english":"It is your Lord Who steers the ships for you through the sea, so that you may seek His bounty. Surely He is ever Merciful to you."},{"id":2096,"verseNumber":67,"verseKey":"17:67","arabic":"وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِى ٱلْبَحْرِ ضَلَّ مَن تَدْعُونَ إِلَّآ إِيَّاهُ ۖ فَلَمَّا نَجَّىٰكُمْ إِلَى ٱلْبَرِّ أَعْرَضْتُمْ ۚ وَكَانَ ٱلْإِنسَـٰنُ كَفُورًا","english":"When you are touched with hardship at sea, you ˹totally˺ forget all ˹the gods˺ you ˹normally˺ invoke, except Him. But when He delivers you ˹safely˺ to shore, you turn away. Humankind is ever ungrateful."},{"id":2097,"verseNumber":68,"verseKey":"17:68","arabic":"أَفَأَمِنتُمْ أَن يَخْسِفَ بِكُمْ جَانِبَ ٱلْبَرِّ أَوْ يُرْسِلَ عَلَيْكُمْ حَاصِبًا ثُمَّ لَا تَجِدُوا۟ لَكُمْ وَكِيلًا","english":"Do you feel secure that He will not cause the land to swallow you up, or unleash upon you a storm of stones? Then you will find none to protect you."},{"id":2098,"verseNumber":69,"verseKey":"17:69","arabic":"أَمْ أَمِنتُمْ أَن يُعِيدَكُمْ فِيهِ تَارَةً أُخْرَىٰ فَيُرْسِلَ عَلَيْكُمْ قَاصِفًا مِّنَ ٱلرِّيحِ فَيُغْرِقَكُم بِمَا كَفَرْتُمْ ۙ ثُمَّ لَا تَجِدُوا۟ لَكُمْ عَلَيْنَا بِهِۦ تَبِيعًا","english":"Or do you feel secure that He will not send you back to sea once again, and send upon you a violent storm, drowning you for your denial? Then you will find none to avenge you against Us."},{"id":2099,"verseNumber":70,"verseKey":"17:70","arabic":"۞ وَلَقَدْ كَرَّمْنَا بَنِىٓ ءَادَمَ وَحَمَلْنَـٰهُمْ فِى ٱلْبَرِّ وَٱلْبَحْرِ وَرَزَقْنَـٰهُم مِّنَ ٱلطَّيِّبَـٰتِ وَفَضَّلْنَـٰهُمْ عَلَىٰ كَثِيرٍ مِّمَّنْ خَلَقْنَا تَفْضِيلًا","english":"Indeed, We have dignified the children of Adam, carried them on land and sea, granted them good and lawful provisions, and privileged them far above many of Our creatures."},{"id":2100,"verseNumber":71,"verseKey":"17:71","arabic":"يَوْمَ نَدْعُوا۟ كُلَّ أُنَاسٍۭ بِإِمَـٰمِهِمْ ۖ فَمَنْ أُوتِىَ كِتَـٰبَهُۥ بِيَمِينِهِۦ فَأُو۟لَـٰٓئِكَ يَقْرَءُونَ كِتَـٰبَهُمْ وَلَا يُظْلَمُونَ فَتِيلًا","english":"˹Beware of˺ the Day We will summon every people with their leader.<sup foot_note=76875>1</sup> So whoever will be given their record in their right hand will read it ˹happily˺ and will not be wronged ˹even by the width of˺ the thread of a date stone."},{"id":2101,"verseNumber":72,"verseKey":"17:72","arabic":"وَمَن كَانَ فِى هَـٰذِهِۦٓ أَعْمَىٰ فَهُوَ فِى ٱلْـَٔاخِرَةِ أَعْمَىٰ وَأَضَلُّ سَبِيلًا","english":"But whoever is blind ˹to the truth˺ in this ˹world˺ will be blind in the Hereafter, and ˹even˺ far more astray from the ˹Right˺ Way."},{"id":2102,"verseNumber":73,"verseKey":"17:73","arabic":"وَإِن كَادُوا۟ لَيَفْتِنُونَكَ عَنِ ٱلَّذِىٓ أَوْحَيْنَآ إِلَيْكَ لِتَفْتَرِىَ عَلَيْنَا غَيْرَهُۥ ۖ وَإِذًا لَّٱتَّخَذُوكَ خَلِيلًا","english":"They definitely ˹thought they˺ were about to lure you away from what We have revealed to you ˹O Prophet˺, hoping that you would attribute something else to Us falsely—and then they would have certainly taken you as a close friend.<sup foot_note=76876>1</sup>"},{"id":2103,"verseNumber":74,"verseKey":"17:74","arabic":"وَلَوْلَآ أَن ثَبَّتْنَـٰكَ لَقَدْ كِدتَّ تَرْكَنُ إِلَيْهِمْ شَيْـًٔا قَلِيلًا","english":"Had We not made you steadfast, you probably would have inclined to them a little,"},{"id":2104,"verseNumber":75,"verseKey":"17:75","arabic":"إِذًا لَّأَذَقْنَـٰكَ ضِعْفَ ٱلْحَيَوٰةِ وَضِعْفَ ٱلْمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَيْنَا نَصِيرًا","english":"and then We truly would have made you taste double ˹punishment˺ both in this life and after death, and you would have found no helper against Us."},{"id":2105,"verseNumber":76,"verseKey":"17:76","arabic":"وَإِن كَادُوا۟ لَيَسْتَفِزُّونَكَ مِنَ ٱلْأَرْضِ لِيُخْرِجُوكَ مِنْهَا ۖ وَإِذًا لَّا يَلْبَثُونَ خِلَـٰفَكَ إِلَّا قَلِيلًا","english":"They were about to intimidate you to drive you out of the land ˹of Mecca˺, but then they would not have survived after you ˹had left˺ except for a little while."},{"id":2106,"verseNumber":77,"verseKey":"17:77","arabic":"سُنَّةَ مَن قَدْ أَرْسَلْنَا قَبْلَكَ مِن رُّسُلِنَا ۖ وَلَا تَجِدُ لِسُنَّتِنَا تَحْوِيلًا","english":"˹This has been˺ Our way with the messengers We sent before you. And you will never find any change in Our way."},{"id":2107,"verseNumber":78,"verseKey":"17:78","arabic":"أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمْسِ إِلَىٰ غَسَقِ ٱلَّيْلِ وَقُرْءَانَ ٱلْفَجْرِ ۖ إِنَّ قُرْءَانَ ٱلْفَجْرِ كَانَ مَشْهُودًا","english":"Observe the prayer from the decline of the sun until the darkness of the night and the dawn prayer, for certainly the dawn prayer is witnessed ˹by angels˺.<sup foot_note=76877>1</sup>"},{"id":2108,"verseNumber":79,"verseKey":"17:79","arabic":"وَمِنَ ٱلَّيْلِ فَتَهَجَّدْ بِهِۦ نَافِلَةً لَّكَ عَسَىٰٓ أَن يَبْعَثَكَ رَبُّكَ مَقَامًا مَّحْمُودًا","english":"And rise at ˹the last˺ part of the night, offering additional prayers, so your Lord may raise you to a station of praise.<sup foot_note=76878>1</sup>"},{"id":2109,"verseNumber":80,"verseKey":"17:80","arabic":"وَقُل رَّبِّ أَدْخِلْنِى مُدْخَلَ صِدْقٍ وَأَخْرِجْنِى مُخْرَجَ صِدْقٍ وَٱجْعَل لِّى مِن لَّدُنكَ سُلْطَـٰنًا نَّصِيرًا","english":"And say, “My Lord! Grant me an honourable entrance and an honourable exit<sup foot_note=76879>1</sup> and give me a supporting authority from Yourself.”"},{"id":2110,"verseNumber":81,"verseKey":"17:81","arabic":"وَقُلْ جَآءَ ٱلْحَقُّ وَزَهَقَ ٱلْبَـٰطِلُ ۚ إِنَّ ٱلْبَـٰطِلَ كَانَ زَهُوقًا","english":"And declare, “The truth has come and falsehood has vanished. Indeed, falsehood is bound to vanish.”"},{"id":2111,"verseNumber":82,"verseKey":"17:82","arabic":"وَنُنَزِّلُ مِنَ ٱلْقُرْءَانِ مَا هُوَ شِفَآءٌ وَرَحْمَةٌ لِّلْمُؤْمِنِينَ ۙ وَلَا يَزِيدُ ٱلظَّـٰلِمِينَ إِلَّا خَسَارًا","english":"We send down the Quran as a healing and mercy for the believers, but it only increases the wrongdoers in loss."},{"id":2112,"verseNumber":83,"verseKey":"17:83","arabic":"وَإِذَآ أَنْعَمْنَا عَلَى ٱلْإِنسَـٰنِ أَعْرَضَ وَنَـَٔا بِجَانِبِهِۦ ۖ وَإِذَا مَسَّهُ ٱلشَّرُّ كَانَ يَـُٔوسًا","english":"When We grant people Our favours, they turn away, acting arrogantly. But when touched with evil, they lose all hope."},{"id":2113,"verseNumber":84,"verseKey":"17:84","arabic":"قُلْ كُلٌّ يَعْمَلُ عَلَىٰ شَاكِلَتِهِۦ فَرَبُّكُمْ أَعْلَمُ بِمَنْ هُوَ أَهْدَىٰ سَبِيلًا","english":"Say, ˹O Prophet,˺ “Everyone acts in their own way. But your Lord knows best whose way is rightly guided.”"},{"id":2114,"verseNumber":85,"verseKey":"17:85","arabic":"وَيَسْـَٔلُونَكَ عَنِ ٱلرُّوحِ ۖ قُلِ ٱلرُّوحُ مِنْ أَمْرِ رَبِّى وَمَآ أُوتِيتُم مِّنَ ٱلْعِلْمِ إِلَّا قَلِيلًا","english":"They ask you ˹O Prophet˺ about the spirit. Say, “Its nature is known only to my Lord, and you ˹O humanity˺ have been given but little knowledge.”"},{"id":2115,"verseNumber":86,"verseKey":"17:86","arabic":"وَلَئِن شِئْنَا لَنَذْهَبَنَّ بِٱلَّذِىٓ أَوْحَيْنَآ إِلَيْكَ ثُمَّ لَا تَجِدُ لَكَ بِهِۦ عَلَيْنَا وَكِيلًا","english":"If We willed, We could have certainly taken away what We have revealed to you ˹O Prophet˺—then you would find none to guarantee its return from Us—"},{"id":2116,"verseNumber":87,"verseKey":"17:87","arabic":"إِلَّا رَحْمَةً مِّن رَّبِّكَ ۚ إِنَّ فَضْلَهُۥ كَانَ عَلَيْكَ كَبِيرًا","english":"had it not been for the mercy of your Lord. Indeed, His favour upon you is immense."},{"id":2117,"verseNumber":88,"verseKey":"17:88","arabic":"قُل لَّئِنِ ٱجْتَمَعَتِ ٱلْإِنسُ وَٱلْجِنُّ عَلَىٰٓ أَن يَأْتُوا۟ بِمِثْلِ هَـٰذَا ٱلْقُرْءَانِ لَا يَأْتُونَ بِمِثْلِهِۦ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا","english":"Say, ˹O Prophet,˺ “If ˹all˺ humans and jinn were to come together to produce the equivalent of this Quran, they could not produce its equal, no matter how they supported each other.”"},{"id":2118,"verseNumber":89,"verseKey":"17:89","arabic":"وَلَقَدْ صَرَّفْنَا لِلنَّاسِ فِى هَـٰذَا ٱلْقُرْءَانِ مِن كُلِّ مَثَلٍ فَأَبَىٰٓ أَكْثَرُ ٱلنَّاسِ إِلَّا كُفُورًا","english":"And We have truly set forth every ˹kind of˺ lesson for humanity in this Quran, yet most people persist in disbelief."},{"id":2119,"verseNumber":90,"verseKey":"17:90","arabic":"وَقَالُوا۟ لَن نُّؤْمِنَ لَكَ حَتَّىٰ تَفْجُرَ لَنَا مِنَ ٱلْأَرْضِ يَنۢبُوعًا","english":"They challenge ˹the Prophet˺, “We will never believe in you until you cause a spring to gush forth from the earth for us,"},{"id":2120,"verseNumber":91,"verseKey":"17:91","arabic":"أَوْ تَكُونَ لَكَ جَنَّةٌ مِّن نَّخِيلٍ وَعِنَبٍ فَتُفَجِّرَ ٱلْأَنْهَـٰرَ خِلَـٰلَهَا تَفْجِيرًا","english":"or until you have a garden of palm trees and vineyards, and cause rivers to flow abundantly in it,"},{"id":2121,"verseNumber":92,"verseKey":"17:92","arabic":"أَوْ تُسْقِطَ ٱلسَّمَآءَ كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا أَوْ تَأْتِىَ بِٱللَّهِ وَٱلْمَلَـٰٓئِكَةِ قَبِيلًا","english":"or cause the sky to fall upon us in pieces, as you have claimed, or bring Allah and the angels before us, face to face,"},{"id":2122,"verseNumber":93,"verseKey":"17:93","arabic":"أَوْ يَكُونَ لَكَ بَيْتٌ مِّن زُخْرُفٍ أَوْ تَرْقَىٰ فِى ٱلسَّمَآءِ وَلَن نُّؤْمِنَ لِرُقِيِّكَ حَتَّىٰ تُنَزِّلَ عَلَيْنَا كِتَـٰبًا نَّقْرَؤُهُۥ ۗ قُلْ سُبْحَانَ رَبِّى هَلْ كُنتُ إِلَّا بَشَرًا رَّسُولًا","english":"or until you have a house of gold, or you ascend into heaven—and even then we will not believe in your ascension until you bring down to us a book that we can read.” Say, “Glory be to my Lord! Am I not only a human messenger?”"},{"id":2123,"verseNumber":94,"verseKey":"17:94","arabic":"وَمَا مَنَعَ ٱلنَّاسَ أَن يُؤْمِنُوٓا۟ إِذْ جَآءَهُمُ ٱلْهُدَىٰٓ إِلَّآ أَن قَالُوٓا۟ أَبَعَثَ ٱللَّهُ بَشَرًا رَّسُولًا","english":"And nothing has prevented people from believing when guidance comes to them except their protest: “Has Allah sent a human as a messenger?”"},{"id":2124,"verseNumber":95,"verseKey":"17:95","arabic":"قُل لَّوْ كَانَ فِى ٱلْأَرْضِ مَلَـٰٓئِكَةٌ يَمْشُونَ مُطْمَئِنِّينَ لَنَزَّلْنَا عَلَيْهِم مِّنَ ٱلسَّمَآءِ مَلَكًا رَّسُولًا","english":"Say, ˹O Prophet,˺ “Had there been angels walking the earth, well settled, We would have surely sent down for them an angel from heaven as a messenger.”"},{"id":2125,"verseNumber":96,"verseKey":"17:96","arabic":"قُلْ كَفَىٰ بِٱللَّهِ شَهِيدًۢا بَيْنِى وَبَيْنَكُمْ ۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِيرًۢا بَصِيرًا","english":"Say, “Sufficient is Allah as a Witness between me and you. He is certainly All-Knowing, All-Seeing of His servants.”"},{"id":2126,"verseNumber":97,"verseKey":"17:97","arabic":"وَمَن يَهْدِ ٱللَّهُ فَهُوَ ٱلْمُهْتَدِ ۖ وَمَن يُضْلِلْ فَلَن تَجِدَ لَهُمْ أَوْلِيَآءَ مِن دُونِهِۦ ۖ وَنَحْشُرُهُمْ يَوْمَ ٱلْقِيَـٰمَةِ عَلَىٰ وُجُوهِهِمْ عُمْيًا وَبُكْمًا وَصُمًّا ۖ مَّأْوَىٰهُمْ جَهَنَّمُ ۖ كُلَّمَا خَبَتْ زِدْنَـٰهُمْ سَعِيرًا","english":"Whoever Allah guides is truly guided. And whoever He leaves to stray, you will find no guardians for them besides Him. And We will drag them on their faces on the Day of Judgment—deaf, dumb, and blind. Hell will be their home. Whenever it dies down, We will flare it up for them."},{"id":2127,"verseNumber":98,"verseKey":"17:98","arabic":"ذَٰلِكَ جَزَآؤُهُم بِأَنَّهُمْ كَفَرُوا۟ بِـَٔايَـٰتِنَا وَقَالُوٓا۟ أَءِذَا كُنَّا عِظَـٰمًا وَرُفَـٰتًا أَءِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا","english":"That is their reward for rejecting Our signs and asking ˹mockingly˺, “When we are reduced to bones and ashes, will we really be raised as a new creation?”"},{"id":2128,"verseNumber":99,"verseKey":"17:99","arabic":"۞ أَوَلَمْ يَرَوْا۟ أَنَّ ٱللَّهَ ٱلَّذِى خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ قَادِرٌ عَلَىٰٓ أَن يَخْلُقَ مِثْلَهُمْ وَجَعَلَ لَهُمْ أَجَلًا لَّا رَيْبَ فِيهِ فَأَبَى ٱلظَّـٰلِمُونَ إِلَّا كُفُورًا","english":"Have they not realized that Allah, Who created the heavens and the earth, can ˹easily˺ re-create them? He has ˹already˺ set for them a time, about which there is no doubt. But the wrongdoers persist in denial."},{"id":2129,"verseNumber":100,"verseKey":"17:100","arabic":"قُل لَّوْ أَنتُمْ تَمْلِكُونَ خَزَآئِنَ رَحْمَةِ رَبِّىٓ إِذًا لَّأَمْسَكْتُمْ خَشْيَةَ ٱلْإِنفَاقِ ۚ وَكَانَ ٱلْإِنسَـٰنُ قَتُورًا","english":"Say ˹to them, O  Prophet˺, “Even if you were to possess the ˹infinite˺ treasuries of my Lord’s mercy, then you would certainly withhold ˹them˺, fearing they would run out—for humankind is ever stingy!”"},{"id":2130,"verseNumber":101,"verseKey":"17:101","arabic":"وَلَقَدْ ءَاتَيْنَا مُوسَىٰ تِسْعَ ءَايَـٰتٍۭ بَيِّنَـٰتٍ ۖ فَسْـَٔلْ بَنِىٓ إِسْرَٰٓءِيلَ إِذْ جَآءَهُمْ فَقَالَ لَهُۥ فِرْعَوْنُ إِنِّى لَأَظُنُّكَ يَـٰمُوسَىٰ مَسْحُورًا","english":"We surely gave Moses nine clear signs.<sup foot_note=76880>1</sup> ˹You, O  Prophet, can˺ ask the Children of Israel. When Moses came to them, Pharaoh said to him, “I really think that you, O  Moses, are bewitched.”"},{"id":2131,"verseNumber":102,"verseKey":"17:102","arabic":"قَالَ لَقَدْ عَلِمْتَ مَآ أَنزَلَ هَـٰٓؤُلَآءِ إِلَّا رَبُّ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ بَصَآئِرَ وَإِنِّى لَأَظُنُّكَ يَـٰفِرْعَوْنُ مَثْبُورًا","english":"Moses replied, “You know well that none has sent these ˹signs˺ down except the Lord of the heavens and the earth as insights. And I really think that you, O  Pharaoh, are doomed.”"},{"id":2132,"verseNumber":103,"verseKey":"17:103","arabic":"فَأَرَادَ أَن يَسْتَفِزَّهُم مِّنَ ٱلْأَرْضِ فَأَغْرَقْنَـٰهُ وَمَن مَّعَهُۥ جَمِيعًا","english":"So Pharaoh wanted to scare the Israelites out of the land ˹of Egypt˺, but We drowned him and all of those with him."},{"id":2133,"verseNumber":104,"verseKey":"17:104","arabic":"وَقُلْنَا مِنۢ بَعْدِهِۦ لِبَنِىٓ إِسْرَٰٓءِيلَ ٱسْكُنُوا۟ ٱلْأَرْضَ فَإِذَا جَآءَ وَعْدُ ٱلْـَٔاخِرَةِ جِئْنَا بِكُمْ لَفِيفًا","english":"And We said to the Children of Israel after Pharaoh, “Reside in the land, but when the promise of the Hereafter comes to pass,<sup foot_note=76881>1</sup> We will bring you all together.”"},{"id":2134,"verseNumber":105,"verseKey":"17:105","arabic":"وَبِٱلْحَقِّ أَنزَلْنَـٰهُ وَبِٱلْحَقِّ نَزَلَ ۗ وَمَآ أَرْسَلْنَـٰكَ إِلَّا مُبَشِّرًا وَنَذِيرًا","english":"We have sent down the Quran in truth, and with the truth it has come down. We have sent you ˹O Prophet˺ only as a deliverer of good news and a warner."},{"id":2135,"verseNumber":106,"verseKey":"17:106","arabic":"وَقُرْءَانًا فَرَقْنَـٰهُ لِتَقْرَأَهُۥ عَلَى ٱلنَّاسِ عَلَىٰ مُكْثٍ وَنَزَّلْنَـٰهُ تَنزِيلًا","english":"˹It is˺ a Quran We have revealed in stages so that you may recite it to people at a deliberate pace. And We have sent it down in successive revelations."},{"id":2136,"verseNumber":107,"verseKey":"17:107","arabic":"قُلْ ءَامِنُوا۟ بِهِۦٓ أَوْ لَا تُؤْمِنُوٓا۟ ۚ إِنَّ ٱلَّذِينَ أُوتُوا۟ ٱلْعِلْمَ مِن قَبْلِهِۦٓ إِذَا يُتْلَىٰ عَلَيْهِمْ يَخِرُّونَ لِلْأَذْقَانِ سُجَّدًا","english":"Say, ˹O Prophet,˺ “Believe in this ˹Quran˺, or do not. Indeed, when it is recited to those who were gifted with knowledge<sup foot_note=76882>1</sup> before it ˹was revealed˺, they fall upon their faces in prostration,"},{"id":2137,"verseNumber":108,"verseKey":"17:108","arabic":"وَيَقُولُونَ سُبْحَـٰنَ رَبِّنَآ إِن كَانَ وَعْدُ رَبِّنَا لَمَفْعُولًا","english":"and say, ‘Glory be to our Lord! Surely the promise of our Lord has been fulfilled.’"},{"id":2138,"verseNumber":109,"verseKey":"17:109","arabic":"وَيَخِرُّونَ لِلْأَذْقَانِ يَبْكُونَ وَيَزِيدُهُمْ خُشُوعًا ۩","english":"And they fall down upon their faces weeping, and it increases them in humility.”"},{"id":2139,"verseNumber":110,"verseKey":"17:110","arabic":"قُلِ ٱدْعُوا۟ ٱللَّهَ أَوِ ٱدْعُوا۟ ٱلرَّحْمَـٰنَ ۖ أَيًّا مَّا تَدْعُوا۟ فَلَهُ ٱلْأَسْمَآءُ ٱلْحُسْنَىٰ ۚ وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَٱبْتَغِ بَيْنَ ذَٰلِكَ سَبِيلًا","english":"Say, ˹O Prophet,˺ “Call upon Allah or call upon the Most Compassionate—whichever you call, He has the Most Beautiful Names.” Do not recite your prayers too loudly or silently, but seek a way between."},{"id":2140,"verseNumber":111,"verseKey":"17:111","arabic":"وَقُلِ ٱلْحَمْدُ لِلَّهِ ٱلَّذِى لَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُن لَّهُۥ شَرِيكٌ فِى ٱلْمُلْكِ وَلَمْ يَكُن لَّهُۥ وَلِىٌّ مِّنَ ٱلذُّلِّ ۖ وَكَبِّرْهُ تَكْبِيرًۢا","english":"And say, “All praise is for Allah, Who has never had ˹any˺ offspring;<sup foot_note=76883>1</sup> nor does He have a partner in ˹governing˺ the kingdom;<sup foot_note=76884>2</sup> nor is He pathetic, needing a protector.<sup foot_note=76885>3</sup> And revere Him immensely.”"}]}
