{"verses":[{"id":2484,"verseNumber":1,"verseKey":"21:1","arabic":" ٱقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِى غَفْلَةٍ مُّعْرِضُونَ","english":"˹The time of˺ people’s judgment has drawn near, yet they are heedlessly turning away."},{"id":2485,"verseNumber":2,"verseKey":"21:2","arabic":"مَا يَأْتِيهِم مِّن ذِكْرٍ مِّن رَّبِّهِم مُّحْدَثٍ إِلَّا ٱسْتَمَعُوهُ وَهُمْ يَلْعَبُونَ","english":"Whatever new reminder comes to them from their Lord, they only listen to it jokingly,"},{"id":2486,"verseNumber":3,"verseKey":"21:3","arabic":"لَاهِيَةً قُلُوبُهُمْ ۗ وَأَسَرُّوا۟ ٱلنَّجْوَى ٱلَّذِينَ ظَلَمُوا۟ هَلْ هَـٰذَآ إِلَّا بَشَرٌ مِّثْلُكُمْ ۖ أَفَتَأْتُونَ ٱلسِّحْرَ وَأَنتُمْ تُبْصِرُونَ","english":"with their hearts ˹totally˺ distracted. The evildoers would converse secretly, ˹saying,˺ “Is this ˹one˺ not human like yourselves? Would you fall for ˹this˺ witchcraft, even though you can ˹clearly˺ see?”"},{"id":2487,"verseNumber":4,"verseKey":"21:4","arabic":"قَالَ رَبِّى يَعْلَمُ ٱلْقَوْلَ فِى ٱلسَّمَآءِ وَٱلْأَرْضِ ۖ وَهُوَ ٱلسَّمِيعُ ٱلْعَلِيمُ","english":"The Prophet responded, “My Lord ˹fully˺ knows every word spoken in the heavens and the earth. For He is the All-Hearing, All-Knowing.”"},{"id":2488,"verseNumber":5,"verseKey":"21:5","arabic":"بَلْ قَالُوٓا۟ أَضْغَـٰثُ أَحْلَـٰمٍۭ بَلِ ٱفْتَرَىٰهُ بَلْ هُوَ شَاعِرٌ فَلْيَأْتِنَا بِـَٔايَةٍ كَمَآ أُرْسِلَ ٱلْأَوَّلُونَ","english":"Yet they say, “This ˹Quran˺ is a set of confused dreams! No, he has fabricated it! No, he must be a poet! So let him bring us a ˹tangible˺ sign like those ˹prophets˺ sent before.”"},{"id":2489,"verseNumber":6,"verseKey":"21:6","arabic":"مَآ ءَامَنَتْ قَبْلَهُم مِّن قَرْيَةٍ أَهْلَكْنَـٰهَآ ۖ أَفَهُمْ يُؤْمِنُونَ","english":"Not a ˹single˺ society We destroyed before them ever believed ˹after receiving the signs˺. Will these ˹pagans˺ then believe?"},{"id":2490,"verseNumber":7,"verseKey":"21:7","arabic":"وَمَآ أَرْسَلْنَا قَبْلَكَ إِلَّا رِجَالًا نُّوحِىٓ إِلَيْهِمْ ۖ فَسْـَٔلُوٓا۟ أَهْلَ ٱلذِّكْرِ إِن كُنتُمْ لَا تَعْلَمُونَ","english":"We did not send ˹messengers˺ before you ˹O Prophet˺ except mere men inspired by Us. If you ˹polytheists˺ do not know ˹this already˺, then ask those who have knowledge ˹of the Scriptures˺."},{"id":2491,"verseNumber":8,"verseKey":"21:8","arabic":"وَمَا جَعَلْنَـٰهُمْ جَسَدًا لَّا يَأْكُلُونَ ٱلطَّعَامَ وَمَا كَانُوا۟ خَـٰلِدِينَ","english":"We did not give those messengers ˹supernatural˺ bodies that did not need food, nor were they immortal."},{"id":2492,"verseNumber":9,"verseKey":"21:9","arabic":"ثُمَّ صَدَقْنَـٰهُمُ ٱلْوَعْدَ فَأَنجَيْنَـٰهُمْ وَمَن نَّشَآءُ وَأَهْلَكْنَا ٱلْمُسْرِفِينَ","english":"Then We fulfilled Our promise to them, saving them along with whoever We willed and destroying the transgressors."},{"id":2493,"verseNumber":10,"verseKey":"21:10","arabic":"لَقَدْ أَنزَلْنَآ إِلَيْكُمْ كِتَـٰبًا فِيهِ ذِكْرُكُمْ ۖ أَفَلَا تَعْقِلُونَ","english":"We have surely revealed to you a Book, in which there is glory for you. Will you not then understand?"},{"id":2494,"verseNumber":11,"verseKey":"21:11","arabic":"وَكَمْ قَصَمْنَا مِن قَرْيَةٍ كَانَتْ ظَالِمَةً وَأَنشَأْنَا بَعْدَهَا قَوْمًا ءَاخَرِينَ","english":"˹Imagine˺ how many societies of wrongdoers We have destroyed, raising up other people after them!"},{"id":2495,"verseNumber":12,"verseKey":"21:12","arabic":"فَلَمَّآ أَحَسُّوا۟ بَأْسَنَآ إِذَا هُم مِّنْهَا يَرْكُضُونَ","english":"When the wrongdoers sensed ˹the arrival of˺ Our torment, they started to run away from their cities."},{"id":2496,"verseNumber":13,"verseKey":"21:13","arabic":"لَا تَرْكُضُوا۟ وَٱرْجِعُوٓا۟ إِلَىٰ مَآ أُتْرِفْتُمْ فِيهِ وَمَسَـٰكِنِكُمْ لَعَلَّكُمْ تُسْـَٔلُونَ","english":"˹They were told,˺ “Do not run away! Return to your luxuries and your homes, so you may be questioned ˹about your fate˺.”"},{"id":2497,"verseNumber":14,"verseKey":"21:14","arabic":"قَالُوا۟ يَـٰوَيْلَنَآ إِنَّا كُنَّا ظَـٰلِمِينَ","english":"They cried, “Woe to us! We have surely been wrongdoers.”"},{"id":2498,"verseNumber":15,"verseKey":"21:15","arabic":"فَمَا زَالَت تِّلْكَ دَعْوَىٰهُمْ حَتَّىٰ جَعَلْنَـٰهُمْ حَصِيدًا خَـٰمِدِينَ","english":"They kept repeating their cry until We mowed them down, ˹leaving them˺ lifeless.<sup foot_note=76963>1</sup> "},{"id":2499,"verseNumber":16,"verseKey":"21:16","arabic":"وَمَا خَلَقْنَا ٱلسَّمَآءَ وَٱلْأَرْضَ وَمَا بَيْنَهُمَا لَـٰعِبِينَ","english":"We did not create the heavens and the earth and everything in between for sport."},{"id":2500,"verseNumber":17,"verseKey":"21:17","arabic":"لَوْ أَرَدْنَآ أَن نَّتَّخِذَ لَهْوًا لَّٱتَّخَذْنَـٰهُ مِن لَّدُنَّآ إِن كُنَّا فَـٰعِلِينَ","english":"Had We intended to take ˹some˺ amusement, We could have found it in Our presence, if that had been Our Will."},{"id":2501,"verseNumber":18,"verseKey":"21:18","arabic":"بَلْ نَقْذِفُ بِٱلْحَقِّ عَلَى ٱلْبَـٰطِلِ فَيَدْمَغُهُۥ فَإِذَا هُوَ زَاهِقٌ ۚ وَلَكُمُ ٱلْوَيْلُ مِمَّا تَصِفُونَ","english":"In fact, We hurl the truth against falsehood, leaving it crushed, and it quickly vanishes. And woe be to you for what you claim!<sup foot_note=76964>1</sup>"},{"id":2502,"verseNumber":19,"verseKey":"21:19","arabic":"وَلَهُۥ مَن فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۚ وَمَنْ عِندَهُۥ لَا يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِۦ وَلَا يَسْتَحْسِرُونَ","english":"To Him belong all those in the heavens and the earth. And those nearest to Him are not too proud to worship Him, nor do they tire."},{"id":2503,"verseNumber":20,"verseKey":"21:20","arabic":"يُسَبِّحُونَ ٱلَّيْلَ وَٱلنَّهَارَ لَا يَفْتُرُونَ","english":"They glorify ˹Him˺ day and night, never wavering."},{"id":2504,"verseNumber":21,"verseKey":"21:21","arabic":"أَمِ ٱتَّخَذُوٓا۟ ءَالِهَةً مِّنَ ٱلْأَرْضِ هُمْ يُنشِرُونَ","english":"Or have they taken gods from the earth, who can raise the dead?"},{"id":2505,"verseNumber":22,"verseKey":"21:22","arabic":"لَوْ كَانَ فِيهِمَآ ءَالِهَةٌ إِلَّا ٱللَّهُ لَفَسَدَتَا ۚ فَسُبْحَـٰنَ ٱللَّهِ رَبِّ ٱلْعَرْشِ عَمَّا يَصِفُونَ","english":"Had there been other gods besides Allah in the heavens or the earth, both ˹realms˺ would have surely been corrupted. So Glorified is Allah, Lord of the Throne, far above what they claim."},{"id":2506,"verseNumber":23,"verseKey":"21:23","arabic":"لَا يُسْـَٔلُ عَمَّا يَفْعَلُ وَهُمْ يُسْـَٔلُونَ","english":"He cannot be questioned about what He does, but they will ˹all˺ be questioned."},{"id":2507,"verseNumber":24,"verseKey":"21:24","arabic":"أَمِ ٱتَّخَذُوا۟ مِن دُونِهِۦٓ ءَالِهَةً ۖ قُلْ هَاتُوا۟ بُرْهَـٰنَكُمْ ۖ هَـٰذَا ذِكْرُ مَن مَّعِىَ وَذِكْرُ مَن قَبْلِى ۗ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ ٱلْحَقَّ ۖ فَهُم مُّعْرِضُونَ","english":"Or have they taken other gods besides Him? Say, ˹O Prophet,˺ “Show ˹me˺ your proof. Here is ˹the Quran,˺ the Reminder for those with me; along with ˹earlier Scriptures,˺ the Reminder for those before me.”<sup foot_note=76965>1</sup> But most of them do not know the truth, so they turn away."},{"id":2508,"verseNumber":25,"verseKey":"21:25","arabic":"وَمَآ أَرْسَلْنَا مِن قَبْلِكَ مِن رَّسُولٍ إِلَّا نُوحِىٓ إِلَيْهِ أَنَّهُۥ لَآ إِلَـٰهَ إِلَّآ أَنَا۠ فَٱعْبُدُونِ","english":"We never sent a messenger before you ˹O Prophet˺ without revealing to him: “There is no god ˹worthy of worship˺ except Me, so worship Me ˹alone˺.”"},{"id":2509,"verseNumber":26,"verseKey":"21:26","arabic":"وَقَالُوا۟ ٱتَّخَذَ ٱلرَّحْمَـٰنُ وَلَدًا ۗ سُبْحَـٰنَهُۥ ۚ بَلْ عِبَادٌ مُّكْرَمُونَ","english":"And they say, “The Most Compassionate has offspring!”<sup foot_note=76966>1</sup> Glory be to Him! In fact, those ˹angels˺ are only ˹His˺ honoured servants,"},{"id":2510,"verseNumber":27,"verseKey":"21:27","arabic":"لَا يَسْبِقُونَهُۥ بِٱلْقَوْلِ وَهُم بِأَمْرِهِۦ يَعْمَلُونَ","english":"who do not speak until He has spoken, ˹only˺ acting at His command."},{"id":2511,"verseNumber":28,"verseKey":"21:28","arabic":"يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يَشْفَعُونَ إِلَّا لِمَنِ ٱرْتَضَىٰ وَهُم مِّنْ خَشْيَتِهِۦ مُشْفِقُونَ","english":"He ˹fully˺ knows what is ahead of them and what is behind them. They do not intercede except for whom He approves, and they tremble in awe of Him."},{"id":2512,"verseNumber":29,"verseKey":"21:29","arabic":"۞ وَمَن يَقُلْ مِنْهُمْ إِنِّىٓ إِلَـٰهٌ مِّن دُونِهِۦ فَذَٰلِكَ نَجْزِيهِ جَهَنَّمَ ۚ كَذَٰلِكَ نَجْزِى ٱلظَّـٰلِمِينَ","english":"Whoever of them were to say, “I am a god besides Him,” they would be rewarded with Hell by Us. This is how We reward the wrongdoers."},{"id":2513,"verseNumber":30,"verseKey":"21:30","arabic":"أَوَلَمْ يَرَ ٱلَّذِينَ كَفَرُوٓا۟ أَنَّ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ كَانَتَا رَتْقًا فَفَتَقْنَـٰهُمَا ۖ وَجَعَلْنَا مِنَ ٱلْمَآءِ كُلَّ شَىْءٍ حَىٍّ ۖ أَفَلَا يُؤْمِنُونَ","english":"Do the disbelievers not realize that the heavens and earth were ˹once˺ one mass then We split them apart?<sup foot_note=76967>1</sup> And We created from water every living thing. Will they not then believe?"},{"id":2514,"verseNumber":31,"verseKey":"21:31","arabic":"وَجَعَلْنَا فِى ٱلْأَرْضِ رَوَٰسِىَ أَن تَمِيدَ بِهِمْ وَجَعَلْنَا فِيهَا فِجَاجًا سُبُلًا لَّعَلَّهُمْ يَهْتَدُونَ","english":"And We have placed firm mountains upon the earth so it does not shake with them, and made in it broad pathways so they may find their way."},{"id":2515,"verseNumber":32,"verseKey":"21:32","arabic":"وَجَعَلْنَا ٱلسَّمَآءَ سَقْفًا مَّحْفُوظًا ۖ وَهُمْ عَنْ ءَايَـٰتِهَا مُعْرِضُونَ","english":"And We have made the sky a well-protected canopy, still they turn away from its signs.<sup foot_note=76968>1</sup>"},{"id":2516,"verseNumber":33,"verseKey":"21:33","arabic":"وَهُوَ ٱلَّذِى خَلَقَ ٱلَّيْلَ وَٱلنَّهَارَ وَٱلشَّمْسَ وَٱلْقَمَرَ ۖ كُلٌّ فِى فَلَكٍ يَسْبَحُونَ","english":"And He is the One Who created the day and the night, the sun and the moon—each travelling in an orbit."},{"id":2517,"verseNumber":34,"verseKey":"21:34","arabic":"وَمَا جَعَلْنَا لِبَشَرٍ مِّن قَبْلِكَ ٱلْخُلْدَ ۖ أَفَإِي۟ن مِّتَّ فَهُمُ ٱلْخَـٰلِدُونَ","english":"We have not granted immortality to any human before you ˹O Prophet˺: so if you die, will they live forever?"},{"id":2518,"verseNumber":35,"verseKey":"21:35","arabic":"كُلُّ نَفْسٍ ذَآئِقَةُ ٱلْمَوْتِ ۗ وَنَبْلُوكُم بِٱلشَّرِّ وَٱلْخَيْرِ فِتْنَةً ۖ وَإِلَيْنَا تُرْجَعُونَ","english":"Every soul will taste death. And We test you ˹O humanity˺ with good and evil as a trial, then to Us you will ˹all˺ be returned."},{"id":2519,"verseNumber":36,"verseKey":"21:36","arabic":"وَإِذَا رَءَاكَ ٱلَّذِينَ كَفَرُوٓا۟ إِن يَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَـٰذَا ٱلَّذِى يَذْكُرُ ءَالِهَتَكُمْ وَهُم بِذِكْرِ ٱلرَّحْمَـٰنِ هُمْ كَـٰفِرُونَ","english":"When the disbelievers see you ˹O Prophet˺, they only make fun of you, ˹saying,˺ “Is this the one who speaks ˹ill˺ of your gods?” while they disbelieve at the mention of the Most Compassionate."},{"id":2520,"verseNumber":37,"verseKey":"21:37","arabic":"خُلِقَ ٱلْإِنسَـٰنُ مِنْ عَجَلٍ ۚ سَأُو۟رِيكُمْ ءَايَـٰتِى فَلَا تَسْتَعْجِلُونِ","english":"Humankind is made of haste. I will soon show you My signs, so do not ask Me to hasten them."},{"id":2521,"verseNumber":38,"verseKey":"21:38","arabic":"وَيَقُولُونَ مَتَىٰ هَـٰذَا ٱلْوَعْدُ إِن كُنتُمْ صَـٰدِقِينَ","english":"They ask ˹the believers˺, “When will this threat come to pass if what you say is true?”"},{"id":2522,"verseNumber":39,"verseKey":"21:39","arabic":"لَوْ يَعْلَمُ ٱلَّذِينَ كَفَرُوا۟ حِينَ لَا يَكُفُّونَ عَن وُجُوهِهِمُ ٱلنَّارَ وَلَا عَن ظُهُورِهِمْ وَلَا هُمْ يُنصَرُونَ","english":"If only the disbelievers knew that a time will come when they will not be able to keep the Fire off their faces or backs, nor will they be helped."},{"id":2523,"verseNumber":40,"verseKey":"21:40","arabic":"بَلْ تَأْتِيهِم بَغْتَةً فَتَبْهَتُهُمْ فَلَا يَسْتَطِيعُونَ رَدَّهَا وَلَا هُمْ يُنظَرُونَ","english":"In fact, the Hour will take them by surprise, leaving them stunned. So they will not be able to avert it, nor will it be delayed from them."},{"id":2524,"verseNumber":41,"verseKey":"21:41","arabic":"وَلَقَدِ ٱسْتُهْزِئَ بِرُسُلٍ مِّن قَبْلِكَ فَحَاقَ بِٱلَّذِينَ سَخِرُوا۟ مِنْهُم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ","english":"˹Other˺ messengers had already been ridiculed before you ˹O Prophet˺, but those who mocked them were overtaken by what they used to ridicule."},{"id":2525,"verseNumber":42,"verseKey":"21:42","arabic":"قُلْ مَن يَكْلَؤُكُم بِٱلَّيْلِ وَٱلنَّهَارِ مِنَ ٱلرَّحْمَـٰنِ ۗ بَلْ هُمْ عَن ذِكْرِ رَبِّهِم مُّعْرِضُونَ","english":"Ask ˹them, O  Prophet,˺ “Who can defend you by day or by night against the Most Compassionate?” Still they turn away from the remembrance of their Lord."},{"id":2526,"verseNumber":43,"verseKey":"21:43","arabic":"أَمْ لَهُمْ ءَالِهَةٌ تَمْنَعُهُم مِّن دُونِنَا ۚ لَا يَسْتَطِيعُونَ نَصْرَ أَنفُسِهِمْ وَلَا هُم مِّنَّا يُصْحَبُونَ","english":"Or do they have gods—other than Us—that can protect them? They cannot ˹even˺ protect themselves, nor will they be aided against Us."},{"id":2527,"verseNumber":44,"verseKey":"21:44","arabic":"بَلْ مَتَّعْنَا هَـٰٓؤُلَآءِ وَءَابَآءَهُمْ حَتَّىٰ طَالَ عَلَيْهِمُ ٱلْعُمُرُ ۗ أَفَلَا يَرَوْنَ أَنَّا نَأْتِى ٱلْأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَآ ۚ أَفَهُمُ ٱلْغَـٰلِبُونَ","english":"In fact, We have allowed enjoyment for these ˹Meccans˺ and their forefathers for such a long time ˹that they took it for granted˺. Do they not see that We gradually reduce ˹their˺ land from its borders? Is it they who will then prevail?"},{"id":2528,"verseNumber":45,"verseKey":"21:45","arabic":"قُلْ إِنَّمَآ أُنذِرُكُم بِٱلْوَحْىِ ۚ وَلَا يَسْمَعُ ٱلصُّمُّ ٱلدُّعَآءَ إِذَا مَا يُنذَرُونَ","english":"Say, ˹O Prophet,˺ “I warn you only by revelation.” But the deaf cannot hear the call when they are warned!"},{"id":2529,"verseNumber":46,"verseKey":"21:46","arabic":"وَلَئِن مَّسَّتْهُمْ نَفْحَةٌ مِّنْ عَذَابِ رَبِّكَ لَيَقُولُنَّ يَـٰوَيْلَنَآ إِنَّا كُنَّا ظَـٰلِمِينَ","english":"If they were touched by even a breath of your Lord’s torment, they would certainly cry, “Woe to us! We have really been wrongdoers.”"},{"id":2530,"verseNumber":47,"verseKey":"21:47","arabic":"وَنَضَعُ ٱلْمَوَٰزِينَ ٱلْقِسْطَ لِيَوْمِ ٱلْقِيَـٰمَةِ فَلَا تُظْلَمُ نَفْسٌ شَيْـًٔا ۖ وَإِن كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا ۗ وَكَفَىٰ بِنَا حَـٰسِبِينَ","english":"We will set up the scales of justice on the Day of Judgment, so no soul will be wronged in the least. And ˹even˺ if a deed is the weight of a mustard seed, We will bring it forth. And sufficient are We as a ˹vigilant˺ Reckoner."},{"id":2531,"verseNumber":48,"verseKey":"21:48","arabic":"وَلَقَدْ ءَاتَيْنَا مُوسَىٰ وَهَـٰرُونَ ٱلْفُرْقَانَ وَضِيَآءً وَذِكْرًا لِّلْمُتَّقِينَ","english":"Indeed, We granted Moses and Aaron the standard ˹to distinguish between right and wrong˺—a light and a reminder for the righteous,"},{"id":2532,"verseNumber":49,"verseKey":"21:49","arabic":"ٱلَّذِينَ يَخْشَوْنَ رَبَّهُم بِٱلْغَيْبِ وَهُم مِّنَ ٱلسَّاعَةِ مُشْفِقُونَ","english":"who are in awe of their Lord without seeing Him,<sup foot_note=76969>1</sup> and are fearful of the Hour."},{"id":2533,"verseNumber":50,"verseKey":"21:50","arabic":"وَهَـٰذَا ذِكْرٌ مُّبَارَكٌ أَنزَلْنَـٰهُ ۚ أَفَأَنتُمْ لَهُۥ مُنكِرُونَ","english":"And this ˹Quran˺ is a blessed reminder which We have revealed. Will you ˹pagans˺ then deny it?"},{"id":2534,"verseNumber":51,"verseKey":"21:51","arabic":"۞ وَلَقَدْ ءَاتَيْنَآ إِبْرَٰهِيمَ رُشْدَهُۥ مِن قَبْلُ وَكُنَّا بِهِۦ عَـٰلِمِينَ","english":"And indeed, We had granted Abraham sound judgment early on, for We knew him well ˹to be worthy of it˺."},{"id":2535,"verseNumber":52,"verseKey":"21:52","arabic":"إِذْ قَالَ لِأَبِيهِ وَقَوْمِهِۦ مَا هَـٰذِهِ ٱلتَّمَاثِيلُ ٱلَّتِىٓ أَنتُمْ لَهَا عَـٰكِفُونَ","english":"˹Remember˺ when he questioned his father and his people, “What are these statues to which you are so devoted?”"},{"id":2536,"verseNumber":53,"verseKey":"21:53","arabic":"قَالُوا۟ وَجَدْنَآ ءَابَآءَنَا لَهَا عَـٰبِدِينَ","english":"They replied, “We found our forefathers worshipping them.”"},{"id":2537,"verseNumber":54,"verseKey":"21:54","arabic":"قَالَ لَقَدْ كُنتُمْ أَنتُمْ وَءَابَآؤُكُمْ فِى ضَلَـٰلٍ مُّبِينٍ","english":"He responded, “Indeed, you and your forefathers have been clearly astray.”"},{"id":2538,"verseNumber":55,"verseKey":"21:55","arabic":"قَالُوٓا۟ أَجِئْتَنَا بِٱلْحَقِّ أَمْ أَنتَ مِنَ ٱللَّـٰعِبِينَ","english":"They asked, “Have you come to us with the truth, or is this a joke?”"},{"id":2539,"verseNumber":56,"verseKey":"21:56","arabic":"قَالَ بَل رَّبُّكُمْ رَبُّ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ٱلَّذِى فَطَرَهُنَّ وَأَنَا۠ عَلَىٰ ذَٰلِكُم مِّنَ ٱلشَّـٰهِدِينَ","english":"He replied, “In fact, your Lord is the Lord of the heavens and the earth, Who created them ˹both˺. And to that I bear witness.”"},{"id":2540,"verseNumber":57,"verseKey":"21:57","arabic":"وَتَٱللَّهِ لَأَكِيدَنَّ أَصْنَـٰمَكُم بَعْدَ أَن تُوَلُّوا۟ مُدْبِرِينَ","english":"˹Then he said to himself,˺ “By Allah! I will surely plot against your idols after you have turned your backs and gone away.”"},{"id":2541,"verseNumber":58,"verseKey":"21:58","arabic":"فَجَعَلَهُمْ جُذَٰذًا إِلَّا كَبِيرًا لَّهُمْ لَعَلَّهُمْ إِلَيْهِ يَرْجِعُونَ","english":"So he smashed them into pieces, except the biggest of them, so they might turn to it ˹for answers˺."},{"id":2542,"verseNumber":59,"verseKey":"21:59","arabic":"قَالُوا۟ مَن فَعَلَ هَـٰذَا بِـَٔالِهَتِنَآ إِنَّهُۥ لَمِنَ ٱلظَّـٰلِمِينَ","english":"They protested, “Who dared do this to our gods? It must be an evildoer!”"},{"id":2543,"verseNumber":60,"verseKey":"21:60","arabic":"قَالُوا۟ سَمِعْنَا فَتًى يَذْكُرُهُمْ يُقَالُ لَهُۥٓ إِبْرَٰهِيمُ","english":"Some said, “We heard a young man, called Abraham, speaking ˹ill˺ of them.”"},{"id":2544,"verseNumber":61,"verseKey":"21:61","arabic":"قَالُوا۟ فَأْتُوا۟ بِهِۦ عَلَىٰٓ أَعْيُنِ ٱلنَّاسِ لَعَلَّهُمْ يَشْهَدُونَ","english":"They demanded, “Bring him before the eyes of the people, so that they may witness ˹his trial˺.”"},{"id":2545,"verseNumber":62,"verseKey":"21:62","arabic":"قَالُوٓا۟ ءَأَنتَ فَعَلْتَ هَـٰذَا بِـَٔالِهَتِنَا يَـٰٓإِبْرَٰهِيمُ","english":"They asked, “Was it you who did this to our gods, O  Abraham?”"},{"id":2546,"verseNumber":63,"verseKey":"21:63","arabic":"قَالَ بَلْ فَعَلَهُۥ كَبِيرُهُمْ هَـٰذَا فَسْـَٔلُوهُمْ إِن كَانُوا۟ يَنطِقُونَ","english":"He replied ˹sarcastically˺, “No, this one—the biggest of them—did it! So ask them, if they can talk!”"},{"id":2547,"verseNumber":64,"verseKey":"21:64","arabic":"فَرَجَعُوٓا۟ إِلَىٰٓ أَنفُسِهِمْ فَقَالُوٓا۟ إِنَّكُمْ أَنتُمُ ٱلظَّـٰلِمُونَ","english":"So they came back to their senses, saying ˹to one another˺, “You yourselves are truly the wrongdoers!”"},{"id":2548,"verseNumber":65,"verseKey":"21:65","arabic":"ثُمَّ نُكِسُوا۟ عَلَىٰ رُءُوسِهِمْ لَقَدْ عَلِمْتَ مَا هَـٰٓؤُلَآءِ يَنطِقُونَ","english":"Then they ˹quickly˺ regressed to their ˹original˺ mind-set, ˹arguing,˺ “You already know that those ˹idols˺ cannot talk.”"},{"id":2549,"verseNumber":66,"verseKey":"21:66","arabic":"قَالَ أَفَتَعْبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا يَنفَعُكُمْ شَيْـًٔا وَلَا يَضُرُّكُمْ","english":"He rebuked ˹them˺, “Do you then worship—instead of Allah—what can neither benefit nor harm you in any way?"},{"id":2550,"verseNumber":67,"verseKey":"21:67","arabic":"أُفٍّ لَّكُمْ وَلِمَا تَعْبُدُونَ مِن دُونِ ٱللَّهِ ۖ أَفَلَا تَعْقِلُونَ","english":"Shame on you and whatever you worship instead of Allah! Do you not have any sense?”"},{"id":2551,"verseNumber":68,"verseKey":"21:68","arabic":"قَالُوا۟ حَرِّقُوهُ وَٱنصُرُوٓا۟ ءَالِهَتَكُمْ إِن كُنتُمْ فَـٰعِلِينَ","english":"They concluded, “Burn him up to avenge your gods, if you must act.”"},{"id":2552,"verseNumber":69,"verseKey":"21:69","arabic":"قُلْنَا يَـٰنَارُ كُونِى بَرْدًا وَسَلَـٰمًا عَلَىٰٓ إِبْرَٰهِيمَ","english":"We ordered, “O fire! Be cool and safe for Abraham!”<sup foot_note=76970>1</sup>"},{"id":2553,"verseNumber":70,"verseKey":"21:70","arabic":"وَأَرَادُوا۟ بِهِۦ كَيْدًا فَجَعَلْنَـٰهُمُ ٱلْأَخْسَرِينَ","english":"They had sought to harm him, but We made them the worst losers."},{"id":2554,"verseNumber":71,"verseKey":"21:71","arabic":"وَنَجَّيْنَـٰهُ وَلُوطًا إِلَى ٱلْأَرْضِ ٱلَّتِى بَـٰرَكْنَا فِيهَا لِلْعَـٰلَمِينَ","english":"Then We delivered him, along with Lot, to the land We had showered with blessings for all people.<sup foot_note=76971>1</sup>"},{"id":2555,"verseNumber":72,"verseKey":"21:72","arabic":"وَوَهَبْنَا لَهُۥٓ إِسْحَـٰقَ وَيَعْقُوبَ نَافِلَةً ۖ وَكُلًّا جَعَلْنَا صَـٰلِحِينَ","english":"And We blessed him with Isaac ˹as a son˺ and Jacob ˹as a grandson˺, as an additional favour—making all of them righteous."},{"id":2556,"verseNumber":73,"verseKey":"21:73","arabic":"وَجَعَلْنَـٰهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا وَأَوْحَيْنَآ إِلَيْهِمْ فِعْلَ ٱلْخَيْرَٰتِ وَإِقَامَ ٱلصَّلَوٰةِ وَإِيتَآءَ ٱلزَّكَوٰةِ ۖ وَكَانُوا۟ لَنَا عَـٰبِدِينَ","english":"We ˹also˺ made them leaders, guiding by Our command, and inspired them to do good deeds, establish prayer, and pay alms-tax. And they were devoted to Our worship."},{"id":2557,"verseNumber":74,"verseKey":"21:74","arabic":"وَلُوطًا ءَاتَيْنَـٰهُ حُكْمًا وَعِلْمًا وَنَجَّيْنَـٰهُ مِنَ ٱلْقَرْيَةِ ٱلَّتِى كَانَت تَّعْمَلُ ٱلْخَبَـٰٓئِثَ ۗ إِنَّهُمْ كَانُوا۟ قَوْمَ سَوْءٍ فَـٰسِقِينَ","english":"And to Lot We gave wisdom and knowledge, and delivered him from the society engrossed in shameful practices. They were certainly an evil, rebellious people."},{"id":2558,"verseNumber":75,"verseKey":"21:75","arabic":"وَأَدْخَلْنَـٰهُ فِى رَحْمَتِنَآ ۖ إِنَّهُۥ مِنَ ٱلصَّـٰلِحِينَ","english":"And We admitted him into Our mercy, ˹for˺ he was truly one of the righteous."},{"id":2559,"verseNumber":76,"verseKey":"21:76","arabic":"وَنُوحًا إِذْ نَادَىٰ مِن قَبْلُ فَٱسْتَجَبْنَا لَهُۥ فَنَجَّيْنَـٰهُ وَأَهْلَهُۥ مِنَ ٱلْكَرْبِ ٱلْعَظِيمِ","english":"And ˹remember˺ when Noah had cried out to Us earlier, so We responded to him and delivered him and his family<sup foot_note=76972>1</sup> from the great distress."},{"id":2560,"verseNumber":77,"verseKey":"21:77","arabic":"وَنَصَرْنَـٰهُ مِنَ ٱلْقَوْمِ ٱلَّذِينَ كَذَّبُوا۟ بِـَٔايَـٰتِنَآ ۚ إِنَّهُمْ كَانُوا۟ قَوْمَ سَوْءٍ فَأَغْرَقْنَـٰهُمْ أَجْمَعِينَ","english":"And We made him prevail over those who had rejected Our signs. They were truly an evil people, so We drowned them all."},{"id":2561,"verseNumber":78,"verseKey":"21:78","arabic":"وَدَاوُۥدَ وَسُلَيْمَـٰنَ إِذْ يَحْكُمَانِ فِى ٱلْحَرْثِ إِذْ نَفَشَتْ فِيهِ غَنَمُ ٱلْقَوْمِ وَكُنَّا لِحُكْمِهِمْ شَـٰهِدِينَ","english":"And ˹remember˺ when David and Solomon passed judgment regarding the crops ruined ˹at night˺ by someone’s sheep, and We were witness to their judgments."},{"id":2562,"verseNumber":79,"verseKey":"21:79","arabic":"فَفَهَّمْنَـٰهَا سُلَيْمَـٰنَ ۚ وَكُلًّا ءَاتَيْنَا حُكْمًا وَعِلْمًا ۚ وَسَخَّرْنَا مَعَ دَاوُۥدَ ٱلْجِبَالَ يُسَبِّحْنَ وَٱلطَّيْرَ ۚ وَكُنَّا فَـٰعِلِينَ","english":"We guided ˹young˺ Solomon to a fairer settlement,<sup foot_note=76973>1</sup> and granted each of them wisdom and knowledge. We subjected the mountains as well as the birds to hymn ˹Our praises˺ along with David. It is We Who did ˹it all˺."},{"id":2563,"verseNumber":80,"verseKey":"21:80","arabic":"وَعَلَّمْنَـٰهُ صَنْعَةَ لَبُوسٍ لَّكُمْ لِتُحْصِنَكُم مِّنۢ بَأْسِكُمْ ۖ فَهَلْ أَنتُمْ شَـٰكِرُونَ","english":"We taught him the art of making body armour to protect you in battle. Will you then be grateful?"},{"id":2564,"verseNumber":81,"verseKey":"21:81","arabic":"وَلِسُلَيْمَـٰنَ ٱلرِّيحَ عَاصِفَةً تَجْرِى بِأَمْرِهِۦٓ إِلَى ٱلْأَرْضِ ٱلَّتِى بَـٰرَكْنَا فِيهَا ۚ وَكُنَّا بِكُلِّ شَىْءٍ عَـٰلِمِينَ","english":"And to Solomon We subjected the raging winds, blowing by his command to the land We had showered with blessings. It is We Who know everything."},{"id":2565,"verseNumber":82,"verseKey":"21:82","arabic":"وَمِنَ ٱلشَّيَـٰطِينِ مَن يَغُوصُونَ لَهُۥ وَيَعْمَلُونَ عَمَلًا دُونَ ذَٰلِكَ ۖ وَكُنَّا لَهُمْ حَـٰفِظِينَ","english":"And ˹We subjected˺ some jinn<sup foot_note=76974>1</sup> that dived for him,<sup foot_note=76975>2</sup> and performed other duties. It is We Who kept them in check."},{"id":2566,"verseNumber":83,"verseKey":"21:83","arabic":"۞ وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُۥٓ أَنِّى مَسَّنِىَ ٱلضُّرُّ وَأَنتَ أَرْحَمُ ٱلرَّٰحِمِينَ","english":"And ˹remember˺ when Job cried out to his Lord, “I have been touched with adversity,<sup foot_note=76976>1</sup> and You are the Most Merciful of the merciful.”"},{"id":2567,"verseNumber":84,"verseKey":"21:84","arabic":"فَٱسْتَجَبْنَا لَهُۥ فَكَشَفْنَا مَا بِهِۦ مِن ضُرٍّ ۖ وَءَاتَيْنَـٰهُ أَهْلَهُۥ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَىٰ لِلْعَـٰبِدِينَ","english":"So We answered his prayer and removed his adversity, and gave him back his family, twice as many, as a mercy from Us and a lesson for the ˹devoted˺ worshippers."},{"id":2568,"verseNumber":85,"verseKey":"21:85","arabic":"وَإِسْمَـٰعِيلَ وَإِدْرِيسَ وَذَا ٱلْكِفْلِ ۖ كُلٌّ مِّنَ ٱلصَّـٰبِرِينَ","english":"And ˹remember˺ Ishmael, Enoch, and Ⱬul-Kifl.<sup foot_note=76977>1</sup> They were all steadfast."},{"id":2569,"verseNumber":86,"verseKey":"21:86","arabic":"وَأَدْخَلْنَـٰهُمْ فِى رَحْمَتِنَآ ۖ إِنَّهُم مِّنَ ٱلصَّـٰلِحِينَ","english":"We admitted them into Our mercy, for they were truly of the righteous."},{"id":2570,"verseNumber":87,"verseKey":"21:87","arabic":"وَذَا ٱلنُّونِ إِذ ذَّهَبَ مُغَـٰضِبًا فَظَنَّ أَن لَّن نَّقْدِرَ عَلَيْهِ فَنَادَىٰ فِى ٱلظُّلُمَـٰتِ أَن لَّآ إِلَـٰهَ إِلَّآ أَنتَ سُبْحَـٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّـٰلِمِينَ","english":"And ˹remember˺ when the Man of the Whale stormed off ˹from his city˺ in a rage, thinking We would not restrain him.<sup foot_note=76978>1</sup> Then in the ˹veils of˺ darkness<sup foot_note=76979>2</sup> he cried out, “There is no god ˹worthy of worship˺ except You. Glory be to You! I have certainly done wrong.”"},{"id":2571,"verseNumber":88,"verseKey":"21:88","arabic":"فَٱسْتَجَبْنَا لَهُۥ وَنَجَّيْنَـٰهُ مِنَ ٱلْغَمِّ ۚ وَكَذَٰلِكَ نُـۨجِى ٱلْمُؤْمِنِينَ","english":"So We answered his prayer and rescued him from anguish. And so do We save the ˹true˺ believers."},{"id":2572,"verseNumber":89,"verseKey":"21:89","arabic":"وَزَكَرِيَّآ إِذْ نَادَىٰ رَبَّهُۥ رَبِّ لَا تَذَرْنِى فَرْدًا وَأَنتَ خَيْرُ ٱلْوَٰرِثِينَ","english":"And ˹remember˺ when Zachariah cried out to his Lord, “My Lord! Do not leave me childless, though You are the Best of Successors.”<sup foot_note=76980>1</sup>"},{"id":2573,"verseNumber":90,"verseKey":"21:90","arabic":"فَٱسْتَجَبْنَا لَهُۥ وَوَهَبْنَا لَهُۥ يَحْيَىٰ وَأَصْلَحْنَا لَهُۥ زَوْجَهُۥٓ ۚ إِنَّهُمْ كَانُوا۟ يُسَـٰرِعُونَ فِى ٱلْخَيْرَٰتِ وَيَدْعُونَنَا رَغَبًا وَرَهَبًا ۖ وَكَانُوا۟ لَنَا خَـٰشِعِينَ","english":"So We answered his prayer, granted him John, and made his wife fertile. Indeed, they used to race in doing good, and call upon Us with hope and fear, totally humbling themselves before Us."},{"id":2574,"verseNumber":91,"verseKey":"21:91","arabic":"وَٱلَّتِىٓ أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهَا مِن رُّوحِنَا وَجَعَلْنَـٰهَا وَٱبْنَهَآ ءَايَةً لِّلْعَـٰلَمِينَ","english":"And ˹remember˺ the one who guarded her chastity, so We breathed into her through Our angel, ˹Gabriel,˺<sup foot_note=76981>1</sup> making her and her son a sign for all peoples."},{"id":2575,"verseNumber":92,"verseKey":"21:92","arabic":"إِنَّ هَـٰذِهِۦٓ أُمَّتُكُمْ أُمَّةً وَٰحِدَةً وَأَنَا۠ رَبُّكُمْ فَٱعْبُدُونِ","english":"˹O prophets!˺ Indeed, this religion of yours is ˹only˺ one, and I am your Lord, so worship Me ˹alone˺."},{"id":2576,"verseNumber":93,"verseKey":"21:93","arabic":"وَتَقَطَّعُوٓا۟ أَمْرَهُم بَيْنَهُمْ ۖ كُلٌّ إِلَيْنَا رَٰجِعُونَ","english":"Yet the people have divided it into sects. But to Us they will all return."},{"id":2577,"verseNumber":94,"verseKey":"21:94","arabic":"فَمَن يَعْمَلْ مِنَ ٱلصَّـٰلِحَـٰتِ وَهُوَ مُؤْمِنٌ فَلَا كُفْرَانَ لِسَعْيِهِۦ وَإِنَّا لَهُۥ كَـٰتِبُونَ","english":"So whoever does good and is a believer will never be denied ˹the reward for˺ their striving, for We are recording it all."},{"id":2578,"verseNumber":95,"verseKey":"21:95","arabic":"وَحَرَٰمٌ عَلَىٰ قَرْيَةٍ أَهْلَكْنَـٰهَآ أَنَّهُمْ لَا يَرْجِعُونَ","english":"It is impossible for a society which We have destroyed to ever rise again,"},{"id":2579,"verseNumber":96,"verseKey":"21:96","arabic":"حَتَّىٰٓ إِذَا فُتِحَتْ يَأْجُوجُ وَمَأْجُوجُ وَهُم مِّن كُلِّ حَدَبٍ يَنسِلُونَ","english":"until ˹after˺ Gog and Magog have broken loose ˹from the barrier˺,<sup foot_note=76982>1</sup> swarming down from every hill,"},{"id":2580,"verseNumber":97,"verseKey":"21:97","arabic":"وَٱقْتَرَبَ ٱلْوَعْدُ ٱلْحَقُّ فَإِذَا هِىَ شَـٰخِصَةٌ أَبْصَـٰرُ ٱلَّذِينَ كَفَرُوا۟ يَـٰوَيْلَنَا قَدْ كُنَّا فِى غَفْلَةٍ مِّنْ هَـٰذَا بَلْ كُنَّا ظَـٰلِمِينَ","english":"ushering in the True Promise.<sup foot_note=76983>1</sup> Then—behold!—the disbelievers will stare ˹in horror, crying,˺ “Oh, woe to us! We have truly been heedless of this. In fact, we have been wrongdoers.”"},{"id":2581,"verseNumber":98,"verseKey":"21:98","arabic":"إِنَّكُمْ وَمَا تَعْبُدُونَ مِن دُونِ ٱللَّهِ حَصَبُ جَهَنَّمَ أَنتُمْ لَهَا وَٰرِدُونَ","english":"Certainly you ˹disbelievers˺ and whatever you worship instead of Allah will be the fuel of Hell.<sup foot_note=76984>1</sup> You are ˹all˺ bound to enter it."},{"id":2582,"verseNumber":99,"verseKey":"21:99","arabic":"لَوْ كَانَ هَـٰٓؤُلَآءِ ءَالِهَةً مَّا وَرَدُوهَا ۖ وَكُلٌّ فِيهَا خَـٰلِدُونَ","english":"Had those idols been ˹true˺ gods, they would not have entered it. And they will be there forever."},{"id":2583,"verseNumber":100,"verseKey":"21:100","arabic":"لَهُمْ فِيهَا زَفِيرٌ وَهُمْ فِيهَا لَا يَسْمَعُونَ","english":"In it they will groan, and will not be able to hear."},{"id":2584,"verseNumber":101,"verseKey":"21:101","arabic":"إِنَّ ٱلَّذِينَ سَبَقَتْ لَهُم مِّنَّا ٱلْحُسْنَىٰٓ أُو۟لَـٰٓئِكَ عَنْهَا مُبْعَدُونَ","english":"Surely those for whom We have destined the finest reward will be kept far away from Hell,"},{"id":2585,"verseNumber":102,"verseKey":"21:102","arabic":"لَا يَسْمَعُونَ حَسِيسَهَا ۖ وَهُمْ فِى مَا ٱشْتَهَتْ أَنفُسُهُمْ خَـٰلِدُونَ","english":"not even hearing the slightest hissing from it. And they will delight forever in what their souls desire."},{"id":2586,"verseNumber":103,"verseKey":"21:103","arabic":"لَا يَحْزُنُهُمُ ٱلْفَزَعُ ٱلْأَكْبَرُ وَتَتَلَقَّىٰهُمُ ٱلْمَلَـٰٓئِكَةُ هَـٰذَا يَوْمُكُمُ ٱلَّذِى كُنتُمْ تُوعَدُونَ","english":"The Supreme Horror ˹of that Day˺ will not disturb them, and the angels will greet them, ˹saying,˺ “This is your Day, which you have been promised.”"},{"id":2587,"verseNumber":104,"verseKey":"21:104","arabic":"يَوْمَ نَطْوِى ٱلسَّمَآءَ كَطَىِّ ٱلسِّجِلِّ لِلْكُتُبِ ۚ كَمَا بَدَأْنَآ أَوَّلَ خَلْقٍ نُّعِيدُهُۥ ۚ وَعْدًا عَلَيْنَآ ۚ إِنَّا كُنَّا فَـٰعِلِينَ","english":"On that Day We will roll up the heavens like a scroll of writings. Just as We produced the first creation, ˹so˺ shall We reproduce it. That is a promise binding on Us. We truly uphold ˹Our promises˺!"},{"id":2588,"verseNumber":105,"verseKey":"21:105","arabic":"وَلَقَدْ كَتَبْنَا فِى ٱلزَّبُورِ مِنۢ بَعْدِ ٱلذِّكْرِ أَنَّ ٱلْأَرْضَ يَرِثُهَا عِبَادِىَ ٱلصَّـٰلِحُونَ","english":"Surely, following the ˹heavenly˺ Record, We decreed in the Scriptures: “My righteous servants shall inherit the land.”<sup foot_note=76985>1</sup>"},{"id":2589,"verseNumber":106,"verseKey":"21:106","arabic":"إِنَّ فِى هَـٰذَا لَبَلَـٰغًا لِّقَوْمٍ عَـٰبِدِينَ","english":"Surely this ˹Quran˺ is sufficient ˹as a reminder˺ for those devoted to worship."},{"id":2590,"verseNumber":107,"verseKey":"21:107","arabic":"وَمَآ أَرْسَلْنَـٰكَ إِلَّا رَحْمَةً لِّلْعَـٰلَمِينَ","english":"We have sent you ˹O Prophet˺ only as a mercy for the whole world."},{"id":2591,"verseNumber":108,"verseKey":"21:108","arabic":"قُلْ إِنَّمَا يُوحَىٰٓ إِلَىَّ أَنَّمَآ إِلَـٰهُكُمْ إِلَـٰهٌ وَٰحِدٌ ۖ فَهَلْ أَنتُم مُّسْلِمُونَ","english":"Say, “What has been revealed to me is this: ‘Your God is only One God.’ Will you then submit?”"},{"id":2592,"verseNumber":109,"verseKey":"21:109","arabic":"فَإِن تَوَلَّوْا۟ فَقُلْ ءَاذَنتُكُمْ عَلَىٰ سَوَآءٍ ۖ وَإِنْ أَدْرِىٓ أَقَرِيبٌ أَم بَعِيدٌ مَّا تُوعَدُونَ","english":"If they turn away, then say, “I have warned you all equally. I do not know if what you are threatened with is near or far."},{"id":2593,"verseNumber":110,"verseKey":"21:110","arabic":"إِنَّهُۥ يَعْلَمُ ٱلْجَهْرَ مِنَ ٱلْقَوْلِ وَيَعْلَمُ مَا تَكْتُمُونَ","english":"Allah surely knows what you say openly and whatever you hide."},{"id":2594,"verseNumber":111,"verseKey":"21:111","arabic":"وَإِنْ أَدْرِى لَعَلَّهُۥ فِتْنَةٌ لَّكُمْ وَمَتَـٰعٌ إِلَىٰ حِينٍ","english":"I do not know if this ˹delay˺ is possibly a test for you and an enjoyment for a while.”"},{"id":2595,"verseNumber":112,"verseKey":"21:112","arabic":"قَـٰلَ رَبِّ ٱحْكُم بِٱلْحَقِّ ۗ وَرَبُّنَا ٱلرَّحْمَـٰنُ ٱلْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ","english":"˹In the end,˺ the Prophet said, “My Lord! Judge ˹between us˺ in truth. And our Lord is the Most Compassionate, Whose help is sought against what you claim.”<sup foot_note=76986>1</sup> "}]}
