{"verses":[{"id":4059,"verseNumber":1,"verseKey":"39:1","arabic":" تَنزِيلُ ٱلْكِتَـٰبِ مِنَ ٱللَّهِ ٱلْعَزِيزِ ٱلْحَكِيمِ","english":"The revelation of this Book is from Allah—the Almighty, All-Wise."},{"id":4060,"verseNumber":2,"verseKey":"39:2","arabic":"إِنَّآ أَنزَلْنَآ إِلَيْكَ ٱلْكِتَـٰبَ بِٱلْحَقِّ فَٱعْبُدِ ٱللَّهَ مُخْلِصًا لَّهُ ٱلدِّينَ","english":"Indeed, We have sent down the Book to you ˹O Prophet˺ in truth, so worship Allah ˹alone˺, being sincerely devoted to Him."},{"id":4061,"verseNumber":3,"verseKey":"39:3","arabic":"أَلَا لِلَّهِ ٱلدِّينُ ٱلْخَالِصُ ۚ وَٱلَّذِينَ ٱتَّخَذُوا۟ مِن دُونِهِۦٓ أَوْلِيَآءَ مَا نَعْبُدُهُمْ إِلَّا لِيُقَرِّبُونَآ إِلَى ٱللَّهِ زُلْفَىٰٓ إِنَّ ٱللَّهَ يَحْكُمُ بَيْنَهُمْ فِى مَا هُمْ فِيهِ يَخْتَلِفُونَ ۗ إِنَّ ٱللَّهَ لَا يَهْدِى مَنْ هُوَ كَـٰذِبٌ كَفَّارٌ","english":"Indeed, sincere devotion is due ˹only˺ to Allah. As for those who take other lords besides Him, ˹saying,˺ “We worship them only so they may bring us closer to Allah,” surely Allah will judge between all<sup foot_note=77283>1</sup> regarding what they differed about. Allah certainly does not guide whoever persists in lying and disbelief."},{"id":4062,"verseNumber":4,"verseKey":"39:4","arabic":"لَّوْ أَرَادَ ٱللَّهُ أَن يَتَّخِذَ وَلَدًا لَّٱصْطَفَىٰ مِمَّا يَخْلُقُ مَا يَشَآءُ ۚ سُبْحَـٰنَهُۥ ۖ هُوَ ٱللَّهُ ٱلْوَٰحِدُ ٱلْقَهَّارُ","english":"Had it been Allah’s Will to have offspring, He could have chosen whatever He willed of His creation. Glory be to Him! He is Allah—the One, the Supreme."},{"id":4063,"verseNumber":5,"verseKey":"39:5","arabic":"خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ بِٱلْحَقِّ ۖ يُكَوِّرُ ٱلَّيْلَ عَلَى ٱلنَّهَارِ وَيُكَوِّرُ ٱلنَّهَارَ عَلَى ٱلَّيْلِ ۖ وَسَخَّرَ ٱلشَّمْسَ وَٱلْقَمَرَ ۖ كُلٌّ يَجْرِى لِأَجَلٍ مُّسَمًّى ۗ أَلَا هُوَ ٱلْعَزِيزُ ٱلْغَفَّـٰرُ","english":"He created the heavens and the earth for a purpose. He wraps the night around the day, and wraps the day around the night. And He has subjected the sun and the moon, each orbiting for an appointed term. He is truly the Almighty, Most Forgiving."},{"id":4064,"verseNumber":6,"verseKey":"39:6","arabic":"خَلَقَكُم مِّن نَّفْسٍ وَٰحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَأَنزَلَ لَكُم مِّنَ ٱلْأَنْعَـٰمِ ثَمَـٰنِيَةَ أَزْوَٰجٍ ۚ يَخْلُقُكُمْ فِى بُطُونِ أُمَّهَـٰتِكُمْ خَلْقًا مِّنۢ بَعْدِ خَلْقٍ فِى ظُلُمَـٰتٍ ثَلَـٰثٍ ۚ ذَٰلِكُمُ ٱللَّهُ رَبُّكُمْ لَهُ ٱلْمُلْكُ ۖ لَآ إِلَـٰهَ إِلَّا هُوَ ۖ فَأَنَّىٰ تُصْرَفُونَ","english":"He created you ˹all˺ from a single soul,<sup foot_note=77284>1</sup> then from it He made its mate.<sup foot_note=77285>2</sup> And He produced for you four pairs of cattle.<sup foot_note=77286>3</sup> He creates you in the wombs of your mothers ˹in stages˺, one development after another, in three layers of darkness.<sup foot_note=77287>4</sup> That is Allah—your Lord! All authority belongs to Him. There is no god ˹worthy of worship˺ except Him. How can you then be turned away?"},{"id":4065,"verseNumber":7,"verseKey":"39:7","arabic":"إِن تَكْفُرُوا۟ فَإِنَّ ٱللَّهَ غَنِىٌّ عَنكُمْ ۖ وَلَا يَرْضَىٰ لِعِبَادِهِ ٱلْكُفْرَ ۖ وَإِن تَشْكُرُوا۟ يَرْضَهُ لَكُمْ ۗ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۗ ثُمَّ إِلَىٰ رَبِّكُم مَّرْجِعُكُمْ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ ۚ إِنَّهُۥ عَلِيمٌۢ بِذَاتِ ٱلصُّدُورِ","english":"If you disbelieve, then ˹know that˺ Allah is truly not in need of you, nor does He approve of disbelief from His servants. But if you become grateful ˹through faith˺, He will appreciate that from you. No soul burdened with sin will bear the burden of another. Then to your Lord is your return, and He will inform you of what you used to do. He certainly knows best what is ˹hidden˺ in the heart."},{"id":4066,"verseNumber":8,"verseKey":"39:8","arabic":"۞ وَإِذَا مَسَّ ٱلْإِنسَـٰنَ ضُرٌّ دَعَا رَبَّهُۥ مُنِيبًا إِلَيْهِ ثُمَّ إِذَا خَوَّلَهُۥ نِعْمَةً مِّنْهُ نَسِىَ مَا كَانَ يَدْعُوٓا۟ إِلَيْهِ مِن قَبْلُ وَجَعَلَ لِلَّهِ أَندَادًا لِّيُضِلَّ عَن سَبِيلِهِۦ ۚ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيلًا ۖ إِنَّكَ مِنْ أَصْحَـٰبِ ٱلنَّارِ","english":"When one is touched with hardship, they cry out to their Lord, turning to Him ˹alone˺. But as soon as He showers them with blessings from Him, they ˹totally˺ forget the One they had cried to earlier, and set up equals to Allah to mislead ˹others˺ from His Way. Say, ˹O Prophet,˺ “Enjoy your disbelief for a little while! You will certainly be one of the inmates of the Fire.”"},{"id":4067,"verseNumber":9,"verseKey":"39:9","arabic":"أَمَّنْ هُوَ قَـٰنِتٌ ءَانَآءَ ٱلَّيْلِ سَاجِدًا وَقَآئِمًا يَحْذَرُ ٱلْـَٔاخِرَةَ وَيَرْجُوا۟ رَحْمَةَ رَبِّهِۦ ۗ قُلْ هَلْ يَسْتَوِى ٱلَّذِينَ يَعْلَمُونَ وَٱلَّذِينَ لَا يَعْلَمُونَ ۗ إِنَّمَا يَتَذَكَّرُ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ","english":"˹Are they better˺ or those who worship ˹their Lord˺ devoutly in the hours of the night, prostrating and standing, fearing the Hereafter and hoping for the mercy of their Lord? Say, ˹O Prophet,˺ “Are those who know equal to those who do not know?” None will be mindful ˹of this˺ except people of reason."},{"id":4068,"verseNumber":10,"verseKey":"39:10","arabic":"قُلْ يَـٰعِبَادِ ٱلَّذِينَ ءَامَنُوا۟ ٱتَّقُوا۟ رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا۟ فِى هَـٰذِهِ ٱلدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ ٱللَّهِ وَٰسِعَةٌ ۗ إِنَّمَا يُوَفَّى ٱلصَّـٰبِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ","english":"Say ˹O Prophet, that Allah says˺, “O My servants who believe! Be mindful of your Lord. Those who do good in this world will have a good reward. And Allah’s earth is spacious. Only those who endure patiently will be given their reward without limit.”"},{"id":4069,"verseNumber":11,"verseKey":"39:11","arabic":"قُلْ إِنِّىٓ أُمِرْتُ أَنْ أَعْبُدَ ٱللَّهَ مُخْلِصًا لَّهُ ٱلدِّينَ","english":"Say, “I am commanded to worship Allah, being sincerely devoted to Him ˹alone˺."},{"id":4070,"verseNumber":12,"verseKey":"39:12","arabic":"وَأُمِرْتُ لِأَنْ أَكُونَ أَوَّلَ ٱلْمُسْلِمِينَ","english":"And I am commanded to be the first of those who submit ˹to His Will˺.”"},{"id":4071,"verseNumber":13,"verseKey":"39:13","arabic":"قُلْ إِنِّىٓ أَخَافُ إِنْ عَصَيْتُ رَبِّى عَذَابَ يَوْمٍ عَظِيمٍ","english":"Say, “I truly fear—if I were to disobey my Lord—the torment of a tremendous Day.”"},{"id":4072,"verseNumber":14,"verseKey":"39:14","arabic":"قُلِ ٱللَّهَ أَعْبُدُ مُخْلِصًا لَّهُۥ دِينِى","english":"Say, “It is ˹only˺ Allah that I worship, being sincere in my devotion to Him."},{"id":4073,"verseNumber":15,"verseKey":"39:15","arabic":"فَٱعْبُدُوا۟ مَا شِئْتُم مِّن دُونِهِۦ ۗ قُلْ إِنَّ ٱلْخَـٰسِرِينَ ٱلَّذِينَ خَسِرُوٓا۟ أَنفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ ٱلْقِيَـٰمَةِ ۗ أَلَا ذَٰلِكَ هُوَ ٱلْخُسْرَانُ ٱلْمُبِينُ","english":"Worship then whatever ˹gods˺ you want instead of Him.” Say, “The ˹true˺ losers are those who will lose themselves and their families on Judgment Day. That is indeed the clearest loss.”"},{"id":4074,"verseNumber":16,"verseKey":"39:16","arabic":"لَهُم مِّن فَوْقِهِمْ ظُلَلٌ مِّنَ ٱلنَّارِ وَمِن تَحْتِهِمْ ظُلَلٌ ۚ ذَٰلِكَ يُخَوِّفُ ٱللَّهُ بِهِۦ عِبَادَهُۥ ۚ يَـٰعِبَادِ فَٱتَّقُونِ","english":"They will have layers of fire above and below them. That is what Allah warns His servants with. So fear Me, O  My servants!"},{"id":4075,"verseNumber":17,"verseKey":"39:17","arabic":"وَٱلَّذِينَ ٱجْتَنَبُوا۟ ٱلطَّـٰغُوتَ أَن يَعْبُدُوهَا وَأَنَابُوٓا۟ إِلَى ٱللَّهِ لَهُمُ ٱلْبُشْرَىٰ ۚ فَبَشِّرْ عِبَادِ","english":"And those who shun the worship of false gods, turning to Allah ˹alone˺, will have good news. So give good news to My servants ˹O Prophet˺—"},{"id":4076,"verseNumber":18,"verseKey":"39:18","arabic":"ٱلَّذِينَ يَسْتَمِعُونَ ٱلْقَوْلَ فَيَتَّبِعُونَ أَحْسَنَهُۥٓ ۚ أُو۟لَـٰٓئِكَ ٱلَّذِينَ هَدَىٰهُمُ ٱللَّهُ ۖ وَأُو۟لَـٰٓئِكَ هُمْ أُو۟لُوا۟ ٱلْأَلْبَـٰبِ","english":"those who listen to what is said and follow the best of it.<sup foot_note=77288>1</sup> These are the ones ˹rightly˺ guided by Allah, and these are ˹truly˺ the people of reason."},{"id":4077,"verseNumber":19,"verseKey":"39:19","arabic":"أَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ ٱلْعَذَابِ أَفَأَنتَ تُنقِذُ مَن فِى ٱلنَّارِ","english":"What about those against whom the decree of torment has been justified? Is it you ˹O Prophet˺ who will then save those bound for the Fire?"},{"id":4078,"verseNumber":20,"verseKey":"39:20","arabic":"لَـٰكِنِ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ لَهُمْ غُرَفٌ مِّن فَوْقِهَا غُرَفٌ مَّبْنِيَّةٌ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ وَعْدَ ٱللَّهِ ۖ لَا يُخْلِفُ ٱللَّهُ ٱلْمِيعَادَ","english":"But those mindful of their Lord will have ˹elevated˺ mansions, built one above the other, under which rivers flow. ˹That is˺ the promise of Allah. ˹And˺ Allah never fails in ˹His˺ promise."},{"id":4079,"verseNumber":21,"verseKey":"39:21","arabic":"أَلَمْ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءً فَسَلَكَهُۥ يَنَـٰبِيعَ فِى ٱلْأَرْضِ ثُمَّ يُخْرِجُ بِهِۦ زَرْعًا مُّخْتَلِفًا أَلْوَٰنُهُۥ ثُمَّ يَهِيجُ فَتَرَىٰهُ مُصْفَرًّا ثُمَّ يَجْعَلُهُۥ حُطَـٰمًا ۚ إِنَّ فِى ذَٰلِكَ لَذِكْرَىٰ لِأُو۟لِى ٱلْأَلْبَـٰبِ","english":"Do you not see that Allah sends down rain from the sky—channelling it through streams in the earth—then produces with it crops of various colours, then they dry up and you see them wither, and then He reduces them to chaff? Surely in this is a reminder for people of reason."},{"id":4080,"verseNumber":22,"verseKey":"39:22","arabic":"أَفَمَن شَرَحَ ٱللَّهُ صَدْرَهُۥ لِلْإِسْلَـٰمِ فَهُوَ عَلَىٰ نُورٍ مِّن رَّبِّهِۦ ۚ فَوَيْلٌ لِّلْقَـٰسِيَةِ قُلُوبُهُم مِّن ذِكْرِ ٱللَّهِ ۚ أُو۟لَـٰٓئِكَ فِى ضَلَـٰلٍ مُّبِينٍ","english":"Can ˹the misguided be like˺ those whose hearts Allah has opened to Islam, so they are enlightened by their Lord? So woe to those whose hearts are hardened at the remembrance of Allah! It is they who are clearly astray."},{"id":4081,"verseNumber":23,"verseKey":"39:23","arabic":"ٱللَّهُ نَزَّلَ أَحْسَنَ ٱلْحَدِيثِ كِتَـٰبًا مُّتَشَـٰبِهًا مَّثَانِىَ تَقْشَعِرُّ مِنْهُ جُلُودُ ٱلَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ ٱللَّهِ ۚ ذَٰلِكَ هُدَى ٱللَّهِ يَهْدِى بِهِۦ مَن يَشَآءُ ۚ وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِنْ هَادٍ","english":"˹It is˺ Allah ˹Who˺ has sent down the best message—a Book of perfect consistency and repeated lessons—which causes the skin ˹and hearts˺ of those who fear their Lord to tremble, then their skin and hearts soften at the mention of ˹the mercy of˺ Allah. That is the guidance of Allah, through which He guides whoever He wills. But whoever Allah leaves to stray will be left with no guide."},{"id":4082,"verseNumber":24,"verseKey":"39:24","arabic":"أَفَمَن يَتَّقِى بِوَجْهِهِۦ سُوٓءَ ٱلْعَذَابِ يَوْمَ ٱلْقِيَـٰمَةِ ۚ وَقِيلَ لِلظَّـٰلِمِينَ ذُوقُوا۟ مَا كُنتُمْ تَكْسِبُونَ","english":"Are those who will only have their ˹bare˺ faces to shield themselves from the awful torment on Judgment Day ˹better than those in Paradise˺? It will ˹then˺ be said to the wrongdoers: “Reap what you sowed!”"},{"id":4083,"verseNumber":25,"verseKey":"39:25","arabic":"كَذَّبَ ٱلَّذِينَ مِن قَبْلِهِمْ فَأَتَىٰهُمُ ٱلْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُونَ","english":"Those before them ˹also˺ rejected ˹the truth˺, then the torment came upon them from where they least expected."},{"id":4084,"verseNumber":26,"verseKey":"39:26","arabic":"فَأَذَاقَهُمُ ٱللَّهُ ٱلْخِزْىَ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا ۖ وَلَعَذَابُ ٱلْـَٔاخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا۟ يَعْلَمُونَ","english":"So Allah made them taste humiliation in this worldly life, but far worse is the punishment of the Hereafter, if only they knew."},{"id":4085,"verseNumber":27,"verseKey":"39:27","arabic":"وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِى هَـٰذَا ٱلْقُرْءَانِ مِن كُلِّ مَثَلٍ لَّعَلَّهُمْ يَتَذَكَّرُونَ","english":"We have certainly set forth every ˹kind of˺ lesson for people in this Quran, so perhaps they will be mindful."},{"id":4086,"verseNumber":28,"verseKey":"39:28","arabic":"قُرْءَانًا عَرَبِيًّا غَيْرَ ذِى عِوَجٍ لَّعَلَّهُمْ يَتَّقُونَ","english":"˹It is˺ a Quran ˹revealed˺ in Arabic without any crookedness, so perhaps they will be conscious ˹of Allah˺."},{"id":4087,"verseNumber":29,"verseKey":"39:29","arabic":"ضَرَبَ ٱللَّهُ مَثَلًا رَّجُلًا فِيهِ شُرَكَآءُ مُتَشَـٰكِسُونَ وَرَجُلًا سَلَمًا لِّرَجُلٍ هَلْ يَسْتَوِيَانِ مَثَلًا ۚ ٱلْحَمْدُ لِلَّهِ ۚ بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ","english":"Allah sets forth the parable of a slave owned by several quarrelsome masters, and a slave owned by only one master. Are they equal in condition?<sup foot_note=77289>1</sup> Praise be to Allah! In fact, most of them do not know."},{"id":4088,"verseNumber":30,"verseKey":"39:30","arabic":"إِنَّكَ مَيِّتٌ وَإِنَّهُم مَّيِّتُونَ","english":"You ˹O Prophet˺ will certainly die, and they will die too."},{"id":4089,"verseNumber":31,"verseKey":"39:31","arabic":"ثُمَّ إِنَّكُمْ يَوْمَ ٱلْقِيَـٰمَةِ عِندَ رَبِّكُمْ تَخْتَصِمُونَ","english":"Then on the Day of Judgment you will ˹all settle your˺ dispute before your Lord."},{"id":4090,"verseNumber":32,"verseKey":"39:32","arabic":"۞ فَمَنْ أَظْلَمُ مِمَّن كَذَبَ عَلَى ٱللَّهِ وَكَذَّبَ بِٱلصِّدْقِ إِذْ جَآءَهُۥٓ ۚ أَلَيْسَ فِى جَهَنَّمَ مَثْوًى لِّلْكَـٰفِرِينَ","english":"Who then does more wrong than those who lie about Allah and reject the truth after it has reached them? Is Hell not a ˹fitting˺ home for the disbelievers?"},{"id":4091,"verseNumber":33,"verseKey":"39:33","arabic":"وَٱلَّذِى جَآءَ بِٱلصِّدْقِ وَصَدَّقَ بِهِۦٓ ۙ أُو۟لَـٰٓئِكَ هُمُ ٱلْمُتَّقُونَ","english":"And the one who has brought the truth and those who embrace it—it is they who are the righteous."},{"id":4092,"verseNumber":34,"verseKey":"39:34","arabic":"لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمْ ۚ ذَٰلِكَ جَزَآءُ ٱلْمُحْسِنِينَ","english":"They will have whatever they desire with their Lord. That is the reward of the good-doers."},{"id":4093,"verseNumber":35,"verseKey":"39:35","arabic":"لِيُكَفِّرَ ٱللَّهُ عَنْهُمْ أَسْوَأَ ٱلَّذِى عَمِلُوا۟ وَيَجْزِيَهُمْ أَجْرَهُم بِأَحْسَنِ ٱلَّذِى كَانُوا۟ يَعْمَلُونَ","english":"As such, Allah will absolve them of ˹even˺ the worst of what they did and reward them according to the best of what they used to do."},{"id":4094,"verseNumber":36,"verseKey":"39:36","arabic":"أَلَيْسَ ٱللَّهُ بِكَافٍ عَبْدَهُۥ ۖ وَيُخَوِّفُونَكَ بِٱلَّذِينَ مِن دُونِهِۦ ۚ وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِنْ هَادٍ","english":"Is Allah not sufficient for His servant? Yet they threaten you with other ˹powerless˺ gods besides Him! Whoever Allah leaves to stray will be left with no guide."},{"id":4095,"verseNumber":37,"verseKey":"39:37","arabic":"وَمَن يَهْدِ ٱللَّهُ فَمَا لَهُۥ مِن مُّضِلٍّ ۗ أَلَيْسَ ٱللَّهُ بِعَزِيزٍ ذِى ٱنتِقَامٍ","english":"And whoever Allah guides, none can lead astray. Is Allah not Almighty, capable of punishment?"},{"id":4096,"verseNumber":38,"verseKey":"39:38","arabic":"وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ لَيَقُولُنَّ ٱللَّهُ ۚ قُلْ أَفَرَءَيْتُم مَّا تَدْعُونَ مِن دُونِ ٱللَّهِ إِنْ أَرَادَنِىَ ٱللَّهُ بِضُرٍّ هَلْ هُنَّ كَـٰشِفَـٰتُ ضُرِّهِۦٓ أَوْ أَرَادَنِى بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَـٰتُ رَحْمَتِهِۦ ۚ قُلْ حَسْبِىَ ٱللَّهُ ۖ عَلَيْهِ يَتَوَكَّلُ ٱلْمُتَوَكِّلُونَ","english":"If you ask them ˹O Prophet˺ who created the heavens and the earth, they will certainly say, “Allah!” Ask ˹them˺, “Consider then whatever ˹idols˺ you invoke besides Allah: if it was Allah’s Will to harm me, could they undo that harm? Or if He willed ˹some˺ mercy for me, could they withhold His mercy?” Say, “Allah is sufficient for me. In Him ˹alone˺ the faithful put their trust.”"},{"id":4097,"verseNumber":39,"verseKey":"39:39","arabic":"قُلْ يَـٰقَوْمِ ٱعْمَلُوا۟ عَلَىٰ مَكَانَتِكُمْ إِنِّى عَـٰمِلٌ ۖ فَسَوْفَ تَعْلَمُونَ","english":"Say, ˹O Prophet,˺ “O my people! Persist in your ways, for I ˹too˺ will persist in mine. You will soon come to know"},{"id":4098,"verseNumber":40,"verseKey":"39:40","arabic":"مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ","english":"who will be visited by a humiliating torment ˹in this life˺ and overwhelmed by an everlasting punishment ˹in the next˺.”"},{"id":4099,"verseNumber":41,"verseKey":"39:41","arabic":"إِنَّآ أَنزَلْنَا عَلَيْكَ ٱلْكِتَـٰبَ لِلنَّاسِ بِٱلْحَقِّ ۖ فَمَنِ ٱهْتَدَىٰ فَلِنَفْسِهِۦ ۖ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا ۖ وَمَآ أَنتَ عَلَيْهِم بِوَكِيلٍ","english":"Surely We have revealed to you the Book ˹O Prophet˺ with the truth for humanity. So whoever chooses to be guided, it is for their own good. And whoever chooses to stray, it is only to their own loss. You are not a keeper over them."},{"id":4100,"verseNumber":42,"verseKey":"39:42","arabic":"ٱللَّهُ يَتَوَفَّى ٱلْأَنفُسَ حِينَ مَوْتِهَا وَٱلَّتِى لَمْ تَمُتْ فِى مَنَامِهَا ۖ فَيُمْسِكُ ٱلَّتِى قَضَىٰ عَلَيْهَا ٱلْمَوْتَ وَيُرْسِلُ ٱلْأُخْرَىٰٓ إِلَىٰٓ أَجَلٍ مُّسَمًّى ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّقَوْمٍ يَتَفَكَّرُونَ","english":"˹It is˺ Allah ˹Who˺ calls back the souls ˹of people˺ upon their death as well as ˹the souls˺ of the living during their sleep. Then He keeps those for whom He has ordained death, and releases the others until ˹their˺ appointed time. Surely in this are signs for people who reflect."},{"id":4101,"verseNumber":43,"verseKey":"39:43","arabic":"أَمِ ٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ شُفَعَآءَ ۚ قُلْ أَوَلَوْ كَانُوا۟ لَا يَمْلِكُونَ شَيْـًٔا وَلَا يَعْقِلُونَ","english":"Or have they taken others besides Allah as intercessors? Say, ˹O Prophet,˺ “˹Would they do so,˺ even though those ˹idols˺ have neither authority nor intelligence?”"},{"id":4102,"verseNumber":44,"verseKey":"39:44","arabic":"قُل لِّلَّهِ ٱلشَّفَـٰعَةُ جَمِيعًا ۖ لَّهُۥ مُلْكُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ ثُمَّ إِلَيْهِ تُرْجَعُونَ","english":"Say, “All intercession belongs to Allah ˹alone˺. To Him belongs the kingdom of the heavens and the earth. Then to Him you will ˹all˺ be returned.”"},{"id":4103,"verseNumber":45,"verseKey":"39:45","arabic":"وَإِذَا ذُكِرَ ٱللَّهُ وَحْدَهُ ٱشْمَأَزَّتْ قُلُوبُ ٱلَّذِينَ لَا يُؤْمِنُونَ بِٱلْـَٔاخِرَةِ ۖ وَإِذَا ذُكِرَ ٱلَّذِينَ مِن دُونِهِۦٓ إِذَا هُمْ يَسْتَبْشِرُونَ","english":"Yet when Allah alone is mentioned, the hearts of those who disbelieve in the Hereafter are filled with disgust. But as soon as those ˹gods˺ other than Him are mentioned, they are filled with joy."},{"id":4104,"verseNumber":46,"verseKey":"39:46","arabic":"قُلِ ٱللَّهُمَّ فَاطِرَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ عَـٰلِمَ ٱلْغَيْبِ وَٱلشَّهَـٰدَةِ أَنتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِى مَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ","english":"Say, ˹O Prophet,˺ “O Allah—Originator of the heavens and the earth, Knower of the seen and unseen! You will judge between Your servants regarding their differences.”"},{"id":4105,"verseNumber":47,"verseKey":"39:47","arabic":"وَلَوْ أَنَّ لِلَّذِينَ ظَلَمُوا۟ مَا فِى ٱلْأَرْضِ جَمِيعًا وَمِثْلَهُۥ مَعَهُۥ لَٱفْتَدَوْا۟ بِهِۦ مِن سُوٓءِ ٱلْعَذَابِ يَوْمَ ٱلْقِيَـٰمَةِ ۚ وَبَدَا لَهُم مِّنَ ٱللَّهِ مَا لَمْ يَكُونُوا۟ يَحْتَسِبُونَ","english":"Even if the wrongdoers were to possess everything in the world twice over, they would certainly offer it to ransom themselves from the horrible punishment on Judgment Day, for they will see from Allah what they had never expected."},{"id":4106,"verseNumber":48,"verseKey":"39:48","arabic":"وَبَدَا لَهُمْ سَيِّـَٔاتُ مَا كَسَبُوا۟ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ","english":"And the evil ˹consequences˺ of their deeds will unfold before them, and they will be overwhelmed by what they used to ridicule."},{"id":4107,"verseNumber":49,"verseKey":"39:49","arabic":"فَإِذَا مَسَّ ٱلْإِنسَـٰنَ ضُرٌّ دَعَانَا ثُمَّ إِذَا خَوَّلْنَـٰهُ نِعْمَةً مِّنَّا قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلْمٍۭ ۚ بَلْ هِىَ فِتْنَةٌ وَلَـٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ","english":"When one is touched with hardship, they cry out to Us ˹alone˺. Then when We shower Our blessings upon them, they say, “I have been granted all this only because of ˹my˺ knowledge.” Not at all! It is ˹no more than˺ a test. But most of them do not know."},{"id":4108,"verseNumber":50,"verseKey":"39:50","arabic":"قَدْ قَالَهَا ٱلَّذِينَ مِن قَبْلِهِمْ فَمَآ أَغْنَىٰ عَنْهُم مَّا كَانُوا۟ يَكْسِبُونَ","english":"The same had already been said by those ˹destroyed˺ before them,<sup foot_note=77290>1</sup> but their ˹worldly˺ gains were of no benefit to them."},{"id":4109,"verseNumber":51,"verseKey":"39:51","arabic":"فَأَصَابَهُمْ سَيِّـَٔاتُ مَا كَسَبُوا۟ ۚ وَٱلَّذِينَ ظَلَمُوا۟ مِنْ هَـٰٓؤُلَآءِ سَيُصِيبُهُمْ سَيِّـَٔاتُ مَا كَسَبُوا۟ وَمَا هُم بِمُعْجِزِينَ","english":"So the evil ˹consequences˺ of their deeds overtook them. And the wrongdoers among these ˹pagans˺ will be overtaken by the evil ˹consequences˺ of their deeds. And they will have no escape."},{"id":4110,"verseNumber":52,"verseKey":"39:52","arabic":"أَوَلَمْ يَعْلَمُوٓا۟ أَنَّ ٱللَّهَ يَبْسُطُ ٱلرِّزْقَ لِمَن يَشَآءُ وَيَقْدِرُ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّقَوْمٍ يُؤْمِنُونَ","english":"Do they not know that Allah gives abundant or limited provisions to whoever He wills? Surely in this are signs for people who believe."},{"id":4111,"verseNumber":53,"verseKey":"39:53","arabic":"۞ قُلْ يَـٰعِبَادِىَ ٱلَّذِينَ أَسْرَفُوا۟ عَلَىٰٓ أَنفُسِهِمْ لَا تَقْنَطُوا۟ مِن رَّحْمَةِ ٱللَّهِ ۚ إِنَّ ٱللَّهَ يَغْفِرُ ٱلذُّنُوبَ جَمِيعًا ۚ إِنَّهُۥ هُوَ ٱلْغَفُورُ ٱلرَّحِيمُ","english":"Say, ˹O Prophet, that Allah says,˺ “O My servants who have exceeded the limits against their souls! Do not lose hope in Allah’s mercy, for Allah certainly forgives all sins.<sup foot_note=77291>1</sup> He is indeed the All-Forgiving, Most Merciful."},{"id":4112,"verseNumber":54,"verseKey":"39:54","arabic":"وَأَنِيبُوٓا۟ إِلَىٰ رَبِّكُمْ وَأَسْلِمُوا۟ لَهُۥ مِن قَبْلِ أَن يَأْتِيَكُمُ ٱلْعَذَابُ ثُمَّ لَا تُنصَرُونَ","english":"Turn to your Lord ˹in repentance˺, and ˹fully˺ submit to Him before the punishment reaches you, ˹for˺ then you will not be helped."},{"id":4113,"verseNumber":55,"verseKey":"39:55","arabic":"وَٱتَّبِعُوٓا۟ أَحْسَنَ مَآ أُنزِلَ إِلَيْكُم مِّن رَّبِّكُم مِّن قَبْلِ أَن يَأْتِيَكُمُ ٱلْعَذَابُ بَغْتَةً وَأَنتُمْ لَا تَشْعُرُونَ","english":"Follow ˹the Quran,˺ the best of what has been revealed to you from your Lord, before the punishment takes you by surprise while you are unaware,"},{"id":4114,"verseNumber":56,"verseKey":"39:56","arabic":"أَن تَقُولَ نَفْسٌ يَـٰحَسْرَتَىٰ عَلَىٰ مَا فَرَّطتُ فِى جَنۢبِ ٱللَّهِ وَإِن كُنتُ لَمِنَ ٱلسَّـٰخِرِينَ","english":"so that no ˹sinful˺ soul will say ˹on Judgment Day˺, ‘Woe to me for neglecting ˹my duties towards˺ Allah, while ridiculing ˹the truth˺.’"},{"id":4115,"verseNumber":57,"verseKey":"39:57","arabic":"أَوْ تَقُولَ لَوْ أَنَّ ٱللَّهَ هَدَىٰنِى لَكُنتُ مِنَ ٱلْمُتَّقِينَ","english":"Or ˹a soul will˺ say, ‘If only Allah had guided me, I would have certainly been one of the righteous.’"},{"id":4116,"verseNumber":58,"verseKey":"39:58","arabic":"أَوْ تَقُولَ حِينَ تَرَى ٱلْعَذَابَ لَوْ أَنَّ لِى كَرَّةً فَأَكُونَ مِنَ ٱلْمُحْسِنِينَ","english":"Or say, upon seeing the torment, ‘If only I had a second chance, I would have been one of the good-doers.’"},{"id":4117,"verseNumber":59,"verseKey":"39:59","arabic":"بَلَىٰ قَدْ جَآءَتْكَ ءَايَـٰتِى فَكَذَّبْتَ بِهَا وَٱسْتَكْبَرْتَ وَكُنتَ مِنَ ٱلْكَـٰفِرِينَ","english":"Not at all! My revelations had already come to you, but you rejected them, acted arrogantly, and were one of the disbelievers.”"},{"id":4118,"verseNumber":60,"verseKey":"39:60","arabic":"وَيَوْمَ ٱلْقِيَـٰمَةِ تَرَى ٱلَّذِينَ كَذَبُوا۟ عَلَى ٱللَّهِ وُجُوهُهُم مُّسْوَدَّةٌ ۚ أَلَيْسَ فِى جَهَنَّمَ مَثْوًى لِّلْمُتَكَبِّرِينَ","english":"On the Day of Judgment you will see those who lied about Allah with their faces gloomy. Is Hell not a ˹fitting˺ home for the arrogant?"},{"id":4119,"verseNumber":61,"verseKey":"39:61","arabic":"وَيُنَجِّى ٱللَّهُ ٱلَّذِينَ ٱتَّقَوْا۟ بِمَفَازَتِهِمْ لَا يَمَسُّهُمُ ٱلسُّوٓءُ وَلَا هُمْ يَحْزَنُونَ","english":"And Allah will deliver those who were mindful ˹of Him˺ to their place of ˹ultimate˺ triumph. No evil will touch them, nor will they grieve."},{"id":4120,"verseNumber":62,"verseKey":"39:62","arabic":"ٱللَّهُ خَـٰلِقُ كُلِّ شَىْءٍ ۖ وَهُوَ عَلَىٰ كُلِّ شَىْءٍ وَكِيلٌ","english":"Allah is the Creator of all things, and He is the Maintainer of everything."},{"id":4121,"verseNumber":63,"verseKey":"39:63","arabic":"لَّهُۥ مَقَالِيدُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۗ وَٱلَّذِينَ كَفَرُوا۟ بِـَٔايَـٰتِ ٱللَّهِ أُو۟لَـٰٓئِكَ هُمُ ٱلْخَـٰسِرُونَ","english":"To Him belong the keys ˹of the treasuries˺ of the heavens and the earth. As for those who rejected the signs of Allah, it is they who will be the ˹true˺ losers."},{"id":4122,"verseNumber":64,"verseKey":"39:64","arabic":"قُلْ أَفَغَيْرَ ٱللَّهِ تَأْمُرُوٓنِّىٓ أَعْبُدُ أَيُّهَا ٱلْجَـٰهِلُونَ","english":"Say, ˹O Prophet,˺ “Are you urging me to worship ˹anyone˺ other than Allah, O  ignorant ones?”"},{"id":4123,"verseNumber":65,"verseKey":"39:65","arabic":"وَلَقَدْ أُوحِىَ إِلَيْكَ وَإِلَى ٱلَّذِينَ مِن قَبْلِكَ لَئِنْ أَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُونَنَّ مِنَ ٱلْخَـٰسِرِينَ","english":"It has already been revealed to you—and to those ˹prophets˺ before you—that if you associate others ˹with Allah˺, your deeds will certainly be void and you will truly be one of the losers."},{"id":4124,"verseNumber":66,"verseKey":"39:66","arabic":"بَلِ ٱللَّهَ فَٱعْبُدْ وَكُن مِّنَ ٱلشَّـٰكِرِينَ","english":"Rather, worship Allah ˹alone˺ and be one of the grateful."},{"id":4125,"verseNumber":67,"verseKey":"39:67","arabic":"وَمَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدْرِهِۦ وَٱلْأَرْضُ جَمِيعًا قَبْضَتُهُۥ يَوْمَ ٱلْقِيَـٰمَةِ وَٱلسَّمَـٰوَٰتُ مَطْوِيَّـٰتٌۢ بِيَمِينِهِۦ ۚ سُبْحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا يُشْرِكُونَ","english":"They have not shown Allah His proper reverence—when on the Day of Judgment the ˹whole˺ earth will be in His Grip, and the heavens will be rolled up in His Right Hand. Glorified and Exalted is He above what they associate ˹with Him˺!"},{"id":4126,"verseNumber":68,"verseKey":"39:68","arabic":"وَنُفِخَ فِى ٱلصُّورِ فَصَعِقَ مَن فِى ٱلسَّمَـٰوَٰتِ وَمَن فِى ٱلْأَرْضِ إِلَّا مَن شَآءَ ٱللَّهُ ۖ ثُمَّ نُفِخَ فِيهِ أُخْرَىٰ فَإِذَا هُمْ قِيَامٌ يَنظُرُونَ","english":"The Trumpet will be blown and all those in the heavens and all those on the earth will fall dead, except those Allah wills ˹to spare˺. Then it will be blown again and they will rise up at once, looking on ˹in anticipation˺."},{"id":4127,"verseNumber":69,"verseKey":"39:69","arabic":"وَأَشْرَقَتِ ٱلْأَرْضُ بِنُورِ رَبِّهَا وَوُضِعَ ٱلْكِتَـٰبُ وَجِا۟ىٓءَ بِٱلنَّبِيِّـۧنَ وَٱلشُّهَدَآءِ وَقُضِىَ بَيْنَهُم بِٱلْحَقِّ وَهُمْ لَا يُظْلَمُونَ","english":"The earth<sup foot_note=77292>1</sup> will shine with the light of its Lord, the record ˹of deeds˺ will be laid ˹open˺, the prophets and the witnesses will be brought forward—and judgment will be passed on all with fairness. None will be wronged."},{"id":4128,"verseNumber":70,"verseKey":"39:70","arabic":"وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُوَ أَعْلَمُ بِمَا يَفْعَلُونَ","english":"Every soul will be paid in full for its deeds, for Allah knows best what they have done."},{"id":4129,"verseNumber":71,"verseKey":"39:71","arabic":"وَسِيقَ ٱلَّذِينَ كَفَرُوٓا۟ إِلَىٰ جَهَنَّمَ زُمَرًا ۖ حَتَّىٰٓ إِذَا جَآءُوهَا فُتِحَتْ أَبْوَٰبُهَا وَقَالَ لَهُمْ خَزَنَتُهَآ أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنكُمْ يَتْلُونَ عَلَيْكُمْ ءَايَـٰتِ رَبِّكُمْ وَيُنذِرُونَكُمْ لِقَآءَ يَوْمِكُمْ هَـٰذَا ۚ قَالُوا۟ بَلَىٰ وَلَـٰكِنْ حَقَّتْ كَلِمَةُ ٱلْعَذَابِ عَلَى ٱلْكَـٰفِرِينَ","english":"Those who disbelieved will be driven to Hell in ˹successive˺ groups. When they arrive there, its gates will be opened and its keepers will ask them: “Did messengers not come to you from among yourselves, reciting to you the revelations of your Lord and warning you of the coming of this Day of yours?” The disbelievers will cry, “Yes ˹indeed˺! But the decree of torment has come to pass against the disbelievers.”"},{"id":4130,"verseNumber":72,"verseKey":"39:72","arabic":"قِيلَ ٱدْخُلُوٓا۟ أَبْوَٰبَ جَهَنَّمَ خَـٰلِدِينَ فِيهَا ۖ فَبِئْسَ مَثْوَى ٱلْمُتَكَبِّرِينَ","english":"It will be said to them, “Enter the gates of Hell, to stay there forever.” What an evil home for the arrogant!"},{"id":4131,"verseNumber":73,"verseKey":"39:73","arabic":"وَسِيقَ ٱلَّذِينَ ٱتَّقَوْا۟ رَبَّهُمْ إِلَى ٱلْجَنَّةِ زُمَرًا ۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتْ أَبْوَٰبُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَـٰمٌ عَلَيْكُمْ طِبْتُمْ فَٱدْخُلُوهَا خَـٰلِدِينَ","english":"And those who were mindful of their Lord will be led to Paradise in ˹successive˺ groups. When they arrive at its ˹already˺ open gates, its keepers will say, “Peace be upon you! You have done well, so come in, to stay forever.”"},{"id":4132,"verseNumber":74,"verseKey":"39:74","arabic":"وَقَالُوا۟ ٱلْحَمْدُ لِلَّهِ ٱلَّذِى صَدَقَنَا وَعْدَهُۥ وَأَوْرَثَنَا ٱلْأَرْضَ نَتَبَوَّأُ مِنَ ٱلْجَنَّةِ حَيْثُ نَشَآءُ ۖ فَنِعْمَ أَجْرُ ٱلْعَـٰمِلِينَ","english":"The righteous will say, “Praise be to Allah Who has fulfilled His promise to us, and made us inherit the ˹everlasting˺ land<sup foot_note=77293>1</sup> to settle in Paradise wherever we please.” How excellent is the reward of those who work ˹righteousness˺!"},{"id":4133,"verseNumber":75,"verseKey":"39:75","arabic":"وَتَرَى ٱلْمَلَـٰٓئِكَةَ حَآفِّينَ مِنْ حَوْلِ ٱلْعَرْشِ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ ۖ وَقُضِىَ بَيْنَهُم بِٱلْحَقِّ وَقِيلَ ٱلْحَمْدُ لِلَّهِ رَبِّ ٱلْعَـٰلَمِينَ","english":"You will see the angels all around the Throne, glorifying the praises of their Lord, for judgment will have been passed on all with fairness. And it will be said,<sup foot_note=77294>1</sup> “Praise be to Allah—Lord of all worlds!”"}]}
