{"verses":[{"id":4474,"verseNumber":1,"verseKey":"45:1","arabic":" حمٓ","english":"Ḥâ-Mĩm."},{"id":4475,"verseNumber":2,"verseKey":"45:2","arabic":"تَنزِيلُ ٱلْكِتَـٰبِ مِنَ ٱللَّهِ ٱلْعَزِيزِ ٱلْحَكِيمِ","english":"The revelation of this Book is from Allah—the Almighty, All-Wise."},{"id":4476,"verseNumber":3,"verseKey":"45:3","arabic":"إِنَّ فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ لَـَٔايَـٰتٍ لِّلْمُؤْمِنِينَ","english":"Surely in ˹the creation of˺ the heavens and the earth are signs for the believers."},{"id":4477,"verseNumber":4,"verseKey":"45:4","arabic":"وَفِى خَلْقِكُمْ وَمَا يَبُثُّ مِن دَآبَّةٍ ءَايَـٰتٌ لِّقَوْمٍ يُوقِنُونَ","english":"And in your own creation, and whatever living beings He dispersed, are signs for people of sure faith."},{"id":4478,"verseNumber":5,"verseKey":"45:5","arabic":"وَٱخْتِلَـٰفِ ٱلَّيْلِ وَٱلنَّهَارِ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن رِّزْقٍ فَأَحْيَا بِهِ ٱلْأَرْضَ بَعْدَ مَوْتِهَا وَتَصْرِيفِ ٱلرِّيَـٰحِ ءَايَـٰتٌ لِّقَوْمٍ يَعْقِلُونَ","english":"And ˹in˺ the alternation of the day and the night, the provision<sup foot_note=77353>1</sup> sent down from the skies by Allah—reviving the earth after its death—and the shifting of the winds, are signs for people of understanding."},{"id":4479,"verseNumber":6,"verseKey":"45:6","arabic":"تِلْكَ ءَايَـٰتُ ٱللَّهِ نَتْلُوهَا عَلَيْكَ بِٱلْحَقِّ ۖ فَبِأَىِّ حَدِيثٍۭ بَعْدَ ٱللَّهِ وَءَايَـٰتِهِۦ يُؤْمِنُونَ","english":"These are Allah’s revelations which We recite to you ˹O Prophet˺ in truth. So what message will they believe in after ˹denying˺ Allah and His revelations?"},{"id":4480,"verseNumber":7,"verseKey":"45:7","arabic":"وَيْلٌ لِّكُلِّ أَفَّاكٍ أَثِيمٍ","english":"Woe to every sinful liar."},{"id":4481,"verseNumber":8,"verseKey":"45:8","arabic":"يَسْمَعُ ءَايَـٰتِ ٱللَّهِ تُتْلَىٰ عَلَيْهِ ثُمَّ يُصِرُّ مُسْتَكْبِرًا كَأَن لَّمْ يَسْمَعْهَا ۖ فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ","english":"They hear Allah’s revelations recited to them, then persist ˹in denial˺ arrogantly as if they did not hear them. So give them good news of a painful punishment."},{"id":4482,"verseNumber":9,"verseKey":"45:9","arabic":"وَإِذَا عَلِمَ مِنْ ءَايَـٰتِنَا شَيْـًٔا ٱتَّخَذَهَا هُزُوًا ۚ أُو۟لَـٰٓئِكَ لَهُمْ عَذَابٌ مُّهِينٌ","english":"And whenever they learn anything of Our revelations, they make a mockery of it. It is they who will suffer a humiliating punishment."},{"id":4483,"verseNumber":10,"verseKey":"45:10","arabic":"مِّن وَرَآئِهِمْ جَهَنَّمُ ۖ وَلَا يُغْنِى عَنْهُم مَّا كَسَبُوا۟ شَيْـًٔا وَلَا مَا ٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ أَوْلِيَآءَ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ","english":"Awaiting them is Hell. Their ˹worldly˺ gains will not be of any benefit to them whatsoever, nor will those protectors they have taken besides Allah. And they will suffer a tremendous punishment."},{"id":4484,"verseNumber":11,"verseKey":"45:11","arabic":"هَـٰذَا هُدًى ۖ وَٱلَّذِينَ كَفَرُوا۟ بِـَٔايَـٰتِ رَبِّهِمْ لَهُمْ عَذَابٌ مِّن رِّجْزٍ أَلِيمٌ","english":"This ˹Quran˺ is ˹true˺ guidance. And those who deny their Lord’s revelations will suffer the ˹worst˺ torment of agonizing pain."},{"id":4485,"verseNumber":12,"verseKey":"45:12","arabic":"۞ ٱللَّهُ ٱلَّذِى سَخَّرَ لَكُمُ ٱلْبَحْرَ لِتَجْرِىَ ٱلْفُلْكُ فِيهِ بِأَمْرِهِۦ وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ وَلَعَلَّكُمْ تَشْكُرُونَ","english":"Allah is the One Who has subjected the sea for you so that ships may sail upon it by His command, and that you may seek His bounty, and that perhaps you will be grateful."},{"id":4486,"verseNumber":13,"verseKey":"45:13","arabic":"وَسَخَّرَ لَكُم مَّا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ جَمِيعًا مِّنْهُ ۚ إِنَّ فِى ذَٰلِكَ لَـَٔايَـٰتٍ لِّقَوْمٍ يَتَفَكَّرُونَ","english":"He ˹also˺ subjected for you whatever is in the heavens and whatever is on the earth—all by His grace. Surely in this are signs for people who reflect."},{"id":4487,"verseNumber":14,"verseKey":"45:14","arabic":"قُل لِّلَّذِينَ ءَامَنُوا۟ يَغْفِرُوا۟ لِلَّذِينَ لَا يَرْجُونَ أَيَّامَ ٱللَّهِ لِيَجْزِىَ قَوْمًۢا بِمَا كَانُوا۟ يَكْسِبُونَ","english":"˹O Prophet!˺ Tell the believers to forgive those who do not fear Allah’s days ˹of torment˺, so that He will reward each group for what they used to commit."},{"id":4488,"verseNumber":15,"verseKey":"45:15","arabic":"مَنْ عَمِلَ صَـٰلِحًا فَلِنَفْسِهِۦ ۖ وَمَنْ أَسَآءَ فَعَلَيْهَا ۖ ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ","english":"Whoever does good, it is to their own benefit. And whoever does evil, it is to their own loss. Then to your Lord you will ˹all˺ be returned."},{"id":4489,"verseNumber":16,"verseKey":"45:16","arabic":"وَلَقَدْ ءَاتَيْنَا بَنِىٓ إِسْرَٰٓءِيلَ ٱلْكِتَـٰبَ وَٱلْحُكْمَ وَٱلنُّبُوَّةَ وَرَزَقْنَـٰهُم مِّنَ ٱلطَّيِّبَـٰتِ وَفَضَّلْنَـٰهُمْ عَلَى ٱلْعَـٰلَمِينَ","english":"Indeed, We gave the Children of Israel the Scripture, wisdom, and prophethood; granted them good, lawful provisions; and favoured them above the others.<sup foot_note=77354>1</sup>"},{"id":4490,"verseNumber":17,"verseKey":"45:17","arabic":"وَءَاتَيْنَـٰهُم بَيِّنَـٰتٍ مِّنَ ٱلْأَمْرِ ۖ فَمَا ٱخْتَلَفُوٓا۟ إِلَّا مِنۢ بَعْدِ مَا جَآءَهُمُ ٱلْعِلْمُ بَغْيًۢا بَيْنَهُمْ ۚ إِنَّ رَبَّكَ يَقْضِى بَيْنَهُمْ يَوْمَ ٱلْقِيَـٰمَةِ فِيمَا كَانُوا۟ فِيهِ يَخْتَلِفُونَ","english":"We ˹also˺ gave them clear commandments regarding ˹their˺ faith. But it was not until knowledge came to them that they differed out of mutual envy.<sup foot_note=77355>1</sup> Surely your Lord will judge between them on the Day of Judgment regarding their differences."},{"id":4491,"verseNumber":18,"verseKey":"45:18","arabic":"ثُمَّ جَعَلْنَـٰكَ عَلَىٰ شَرِيعَةٍ مِّنَ ٱلْأَمْرِ فَٱتَّبِعْهَا وَلَا تَتَّبِعْ أَهْوَآءَ ٱلَّذِينَ لَا يَعْلَمُونَ","english":"Now We have set you ˹O Prophet˺ on the ˹clear˺ Way of faith. So follow it, and do not follow the desires of those who do not know ˹the truth˺."},{"id":4492,"verseNumber":19,"verseKey":"45:19","arabic":"إِنَّهُمْ لَن يُغْنُوا۟ عَنكَ مِنَ ٱللَّهِ شَيْـًٔا ۚ وَإِنَّ ٱلظَّـٰلِمِينَ بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ ۖ وَٱللَّهُ وَلِىُّ ٱلْمُتَّقِينَ","english":"They certainly can be of no benefit to you against Allah whatsoever. Surely the wrongdoers are patrons of each other, whereas Allah is the Patron of the righteous."},{"id":4493,"verseNumber":20,"verseKey":"45:20","arabic":"هَـٰذَا بَصَـٰٓئِرُ لِلنَّاسِ وَهُدًى وَرَحْمَةٌ لِّقَوْمٍ يُوقِنُونَ","english":"This ˹Quran˺ is an insight for humanity—a guide and mercy for people of sure faith."},{"id":4494,"verseNumber":21,"verseKey":"45:21","arabic":"أَمْ حَسِبَ ٱلَّذِينَ ٱجْتَرَحُوا۟ ٱلسَّيِّـَٔاتِ أَن نَّجْعَلَهُمْ كَٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَوَآءً مَّحْيَاهُمْ وَمَمَاتُهُمْ ۚ سَآءَ مَا يَحْكُمُونَ","english":"Or do those who commit evil deeds ˹simply˺ think that We will make them equal—in their life and after their death—to those who believe and do good? How wrong is their judgment!"},{"id":4495,"verseNumber":22,"verseKey":"45:22","arabic":"وَخَلَقَ ٱللَّهُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ بِٱلْحَقِّ وَلِتُجْزَىٰ كُلُّ نَفْسٍۭ بِمَا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ","english":"For Allah created the heavens and the earth for a purpose, so that every soul may be paid back for what it has committed. And none will be wronged."},{"id":4496,"verseNumber":23,"verseKey":"45:23","arabic":"أَفَرَءَيْتَ مَنِ ٱتَّخَذَ إِلَـٰهَهُۥ هَوَىٰهُ وَأَضَلَّهُ ٱللَّهُ عَلَىٰ عِلْمٍ وَخَتَمَ عَلَىٰ سَمْعِهِۦ وَقَلْبِهِۦ وَجَعَلَ عَلَىٰ بَصَرِهِۦ غِشَـٰوَةً فَمَن يَهْدِيهِ مِنۢ بَعْدِ ٱللَّهِ ۚ أَفَلَا تَذَكَّرُونَ","english":"Have you seen ˹O Prophet˺ those who have taken their own desires as their god? ˹And so˺ Allah left them to stray knowingly, sealed their hearing and hearts, and placed a cover on their sight. Who then can guide them after Allah? Will you ˹all˺ not then be mindful?"},{"id":4497,"verseNumber":24,"verseKey":"45:24","arabic":"وَقَالُوا۟ مَا هِىَ إِلَّا حَيَاتُنَا ٱلدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا يُهْلِكُنَآ إِلَّا ٱلدَّهْرُ ۚ وَمَا لَهُم بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَظُنُّونَ","english":"And they argue, “There is nothing beyond our worldly life. We die; others are born. And nothing destroys us but ˹the passage of˺ time.” Yet they have no knowledge ˹in support˺ of this ˹claim˺. They only speculate."},{"id":4498,"verseNumber":25,"verseKey":"45:25","arabic":"وَإِذَا تُتْلَىٰ عَلَيْهِمْ ءَايَـٰتُنَا بَيِّنَـٰتٍ مَّا كَانَ حُجَّتَهُمْ إِلَّآ أَن قَالُوا۟ ٱئْتُوا۟ بِـَٔابَآئِنَآ إِن كُنتُمْ صَـٰدِقِينَ","english":"And whenever Our clear revelations are recited to them, their only argument is to say: “Bring our forefathers back, if what you say is true!”"},{"id":4499,"verseNumber":26,"verseKey":"45:26","arabic":"قُلِ ٱللَّهُ يُحْيِيكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يَجْمَعُكُمْ إِلَىٰ يَوْمِ ٱلْقِيَـٰمَةِ لَا رَيْبَ فِيهِ وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لَا يَعْلَمُونَ","english":"Say, ˹O Prophet,˺ “˹It is˺ Allah ˹Who˺ gives you life, then causes you to die, then will gather you ˹all˺ on the Day of Judgment, about which there is no doubt. But most people do not know.”"},{"id":4500,"verseNumber":27,"verseKey":"45:27","arabic":"وَلِلَّهِ مُلْكُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۚ وَيَوْمَ تَقُومُ ٱلسَّاعَةُ يَوْمَئِذٍ يَخْسَرُ ٱلْمُبْطِلُونَ","english":"To Allah ˹alone˺ belongs the kingdom of the heavens and the earth. On the Day the Hour will be established, the people of falsehood will then be in ˹total˺ loss."},{"id":4501,"verseNumber":28,"verseKey":"45:28","arabic":"وَتَرَىٰ كُلَّ أُمَّةٍ جَاثِيَةً ۚ كُلُّ أُمَّةٍ تُدْعَىٰٓ إِلَىٰ كِتَـٰبِهَا ٱلْيَوْمَ تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ","english":"And you will see every faith-community on its knees. Every community will be summoned to its record ˹of deeds˺. ˹They all will be told,˺ “This Day you will be rewarded for what you used to do."},{"id":4502,"verseNumber":29,"verseKey":"45:29","arabic":"هَـٰذَا كِتَـٰبُنَا يَنطِقُ عَلَيْكُم بِٱلْحَقِّ ۚ إِنَّا كُنَّا نَسْتَنسِخُ مَا كُنتُمْ تَعْمَلُونَ","english":"This record of Ours speaks the truth about you. Indeed, We always had your deeds recorded ˹by the angels˺.”"},{"id":4503,"verseNumber":30,"verseKey":"45:30","arabic":"فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فَيُدْخِلُهُمْ رَبُّهُمْ فِى رَحْمَتِهِۦ ۚ ذَٰلِكَ هُوَ ٱلْفَوْزُ ٱلْمُبِينُ","english":"As for those who believed and did good, their Lord will admit them into His mercy. That is ˹truly˺ the absolute triumph."},{"id":4504,"verseNumber":31,"verseKey":"45:31","arabic":"وَأَمَّا ٱلَّذِينَ كَفَرُوٓا۟ أَفَلَمْ تَكُنْ ءَايَـٰتِى تُتْلَىٰ عَلَيْكُمْ فَٱسْتَكْبَرْتُمْ وَكُنتُمْ قَوْمًا مُّجْرِمِينَ","english":"And as for those who disbelieved, ˹they will be told,˺ “Were My revelations not recited to you, yet you acted arrogantly and were a wicked people?"},{"id":4505,"verseNumber":32,"verseKey":"45:32","arabic":"وَإِذَا قِيلَ إِنَّ وَعْدَ ٱللَّهِ حَقٌّ وَٱلسَّاعَةُ لَا رَيْبَ فِيهَا قُلْتُم مَّا نَدْرِى مَا ٱلسَّاعَةُ إِن نَّظُنُّ إِلَّا ظَنًّا وَمَا نَحْنُ بِمُسْتَيْقِنِينَ","english":"And whenever it was said ˹to you˺, ‘Surely Allah’s promise ˹of judgment˺ is true and there is no doubt about the Hour,’ you said ˹mockingly˺, ‘We do not know what the Hour is! We think it is no more than speculation, and we are not convinced ˹that it will ever come˺.’”"},{"id":4506,"verseNumber":33,"verseKey":"45:33","arabic":"وَبَدَا لَهُمْ سَيِّـَٔاتُ مَا عَمِلُوا۟ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ","english":"And the evil ˹consequences˺ of their deeds will unfold before them, and they will be overwhelmed by what they used to ridicule."},{"id":4507,"verseNumber":34,"verseKey":"45:34","arabic":"وَقِيلَ ٱلْيَوْمَ نَنسَىٰكُمْ كَمَا نَسِيتُمْ لِقَآءَ يَوْمِكُمْ هَـٰذَا وَمَأْوَىٰكُمُ ٱلنَّارُ وَمَا لَكُم مِّن نَّـٰصِرِينَ","english":"It will be said, “This Day We will neglect you as you neglected the meeting of this Day of yours! Your home will be the Fire, and you will have no helpers."},{"id":4508,"verseNumber":35,"verseKey":"45:35","arabic":"ذَٰلِكُم بِأَنَّكُمُ ٱتَّخَذْتُمْ ءَايَـٰتِ ٱللَّهِ هُزُوًا وَغَرَّتْكُمُ ٱلْحَيَوٰةُ ٱلدُّنْيَا ۚ فَٱلْيَوْمَ لَا يُخْرَجُونَ مِنْهَا وَلَا هُمْ يُسْتَعْتَبُونَ","english":"This is because you made a mockery of Allah’s revelations, and were deluded by ˹your˺ worldly life.” So ˹from˺ that Day ˹on˺ they will not be taken out of the Fire, nor will they be allowed to appease ˹their Lord˺."},{"id":4509,"verseNumber":36,"verseKey":"45:36","arabic":"فَلِلَّهِ ٱلْحَمْدُ رَبِّ ٱلسَّمَـٰوَٰتِ وَرَبِّ ٱلْأَرْضِ رَبِّ ٱلْعَـٰلَمِينَ","english":"So all praise is for Allah—Lord of the heavens and Lord of the earth, Lord of all worlds."},{"id":4510,"verseNumber":37,"verseKey":"45:37","arabic":"وَلَهُ ٱلْكِبْرِيَآءُ فِى ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ ۖ وَهُوَ ٱلْعَزِيزُ ٱلْحَكِيمُ","english":"To Him belongs ˹all˺ Majesty in the heavens and the earth. And He is the Almighty, All-Wise."}]}
